{
  "January 1": {
    "Scripture Passage": "Genesis 1:1-13",
    "Reflective Question": "How does God’s creative power inspire your view of the world?",
    "Prayer Prompt": "“God, open my eyes to see the beauty and purpose in Your creation.”"
  },
  "January 2": {
    "Scripture Passage": "Genesis 1:14-31",
    "Reflective Question": "What does it mean that you are created in God’s image?",
    "Prayer Prompt": "“Lord, help me reflect Your image in how I live and treat others.”"
  },
  "January 3": {
    "Scripture Passage": "Genesis 2:1-17",
    "Reflective Question": "What does God’s command to rest teach you about your need for renewal?",
    "Prayer Prompt": "“Father, help me find rest in Your presence and purpose in Your commands.”"
  },
  "January 4": {
    "Scripture Passage": "Genesis 2:18-25",
    "Reflective Question": "How does God’s design for companionship impact your relationships?",
    "Prayer Prompt": "“Lord, teach me to value and nurture relationships that honor You.”"
  },
  "January 5": {
    "Scripture Passage": "Genesis 3:1-7",
    "Reflective Question": "What can you learn from Eve’s conversation with the serpent about trusting God’s Word?",
    "Prayer Prompt": "“God, help me to trust Your Word over the lies of the enemy.”"
  },
  "January 6": {
    "Scripture Passage": "Genesis 3:8-19",
    "Reflective Question": "How do Adam and Eve’s responses reflect your own reactions to sin?",
    "Prayer Prompt": "“Lord, lead me to repentance and honesty in my walk with You.”"
  },
  "January 7": {
    "Scripture Passage": "Genesis 3:20-24",
    "Reflective Question": "How does God’s act of clothing Adam and Eve reflect His grace?",
    "Prayer Prompt": "“Father, thank You for covering my shame and offering redemption.”"
  },
  "January 8": {
    "Scripture Passage": "Genesis 6:1-8",
    "Reflective Question": "What does Noah's favor with God teach you about the impact of living righteously in a corrupt world?",
    "Prayer Prompt": "“Lord, help me to live righteously, reflecting Your heart in a world filled with sin.”"
  },
  "January 9": {
    "Scripture Passage": "Genesis 6:9-22",
    "Reflective Question": "How does Noah’s obedience in building the ark inspire you to follow God’s instructions in your life?",
    "Prayer Prompt": "“Father, give me the faith and obedience to follow Your instructions, no matter how daunting they seem.”"
  },
  "January 10": {
    "Scripture Passage": "Genesis 7:1-10",
    "Reflective Question": "What can you learn from Noah’s preparedness and obedience about being ready for God’s work?",
    "Prayer Prompt": "“God, help me to be prepared and ready for Your work, trusting in Your timing.”"
  },
  "January 11": {
    "Scripture Passage": "Genesis 7:11-24",
    "Reflective Question": "How does the flood remind you of the seriousness of sin and the importance of seeking refuge in God?",
    "Prayer Prompt": "“Lord, remind me to seek refuge in You, knowing that only You can save from judgment.”"
  },
  "January 12": {
    "Scripture Passage": "Genesis 8:1-12",
    "Reflective Question": "What does God’s remembrance of Noah teach you about His faithfulness to His promises?",
    "Prayer Prompt": "“Father, thank You for Your faithfulness. Help me to trust that You will remember me in my struggles.”"
  },
  "January 13": {
    "Scripture Passage": "Genesis 8:13-22",
    "Reflective Question": "How does Noah’s act of worship after deliverance inspire you to thank God for His blessings in your life?",
    "Prayer Prompt": "“Lord, help me to always remember to worship You for the blessings and deliverance You provide.”"
  },
  "January 14": {
    "Scripture Passage": "Genesis 9:1-17",
    "Reflective Question": "What does the covenant with Noah teach you about God’s commitment to His creation and His promises?",
    "Prayer Prompt": "“Father, thank You for Your promises. Help me to live in light of Your faithfulness and love.”"
  },
  "January 15": {
    "Scripture Passage": "Genesis 12:1-9",
    "Reflective Question": "How does Abram’s response to God’s call challenge you to step out in faith when God asks you to leave your comfort?",
    "Prayer Prompt": "“Lord, help me to trust You and step out in faith, even when I don’t see the whole path ahead.”"
  },
  "January 16": {
    "Scripture Passage": "Genesis 15:1-6",
    "Reflective Question": "What does Abram’s belief in God’s promise teach you about the importance of faith and trust in God?",
    "Prayer Prompt": "“Father, strengthen my faith to trust in Your promises, even when they seem impossible.”"
  },
  "January 17": {
    "Scripture Passage": "Genesis 15:7-21",
    "Reflective Question": "How does the establishment of this covenant encourage you to understand God’s long-term plan for your life?",
    "Prayer Prompt": "“Lord, help me to see my life as part of Your greater plan and to trust in Your timing.”"
  },
  "January 18": {
    "Scripture Passage": "Genesis 17:1-8",
    "Reflective Question": "What does the name change from Abram to Abraham signify about God’s transformative power in our lives?",
    "Prayer Prompt": "“God, transform my life according to Your purposes and give me a new identity rooted in You.”"
  },
  "January 19": {
    "Scripture Passage": "Genesis 22:1-14",
    "Reflective Question": "What does Abraham’s willingness to sacrifice Isaac teach you about obedience and trust in God?",
    "Prayer Prompt": "“God, help me to trust You even when it’s hard. Give me the courage to obey Your voice in all circumstances.”"
  },
  "January 20": {
    "Scripture Passage": "Genesis 22:15-24",
    "Reflective Question": "How does God’s reaffirmation of His promise after Abraham’s obedience inspire you to trust Him more deeply?",
    "Prayer Prompt": "“Lord, thank You for Your faithfulness in rewarding obedience. Teach me to walk in faithfulness each day.”"
  },
  "January 21": {
    "Scripture Passage": "Genesis 28:10-22",
    "Reflective Question": "How does Jacob’s dream remind you of God’s active presence in your life and His desire to connect with you?",
    "Prayer Prompt": "“Lord, help me to be aware of Your presence in my life and to seek a deeper relationship with You.”"
  },
  "January 22": {
    "Scripture Passage": "Genesis 37:1-11",
    "Reflective Question": "What can Joseph’s dreams teach you about God’s plans, even when others may not understand or support them?",
    "Prayer Prompt": "“God, give me courage to hold onto Your dreams for my life, even in the face of opposition.”"
  },
  "January 23": {
    "Scripture Passage": "Genesis 37:12-36",
    "Reflective Question": "How does Joseph’s hardship remind you that God can use even difficult circumstances for good?",
    "Prayer Prompt": "“Lord, help me to trust Your purposes, even in trials. Turn my challenges into testimonies of Your faithfulness.”"
  },
  "January 24": {
    "Scripture Passage": "Genesis 39:1-23",
    "Reflective Question": "How does Joseph’s response to temptation challenge you to pursue integrity?",
    "Prayer Prompt": "“Father, strengthen me to resist temptation and remain faithful to You, no matter the cost.”"
  },
  "January 25": {
    "Scripture Passage": "Genesis 41:1-16",
    "Reflective Question": "How can Joseph’s humility and reliance on God inspire you to seek God’s wisdom in your life?",
    "Prayer Prompt": "“God, give me the humility to rely on You for wisdom, knowing that true understanding comes from You.”"
  },
  "January 26": {
    "Scripture Passage": "Genesis 41:17-40",
    "Reflective Question": "What does Joseph’s promotion from prison to power show you about God’s timing and sovereignty?",
    "Prayer Prompt": "“Lord, help me to trust Your timing, even when it seems delayed. Let me see Your hand guiding my steps.”"
  },
  "January 27": {
    "Scripture Passage": "Genesis 45:1-15",
    "Reflective Question": "How does Joseph’s forgiveness of his brothers inspire you to forgive those who have wronged you?",
    "Prayer Prompt": "“Father, teach me to forgive others as You have forgiven me. Heal my heart and use me to bring reconciliation.”"
  },
  "January 28": {
    "Scripture Passage": "Genesis 50:15-21",
    "Reflective Question": "How does Joseph’s reassurance to his brothers that God used their actions for good encourage you to trust God’s plans?",
    "Prayer Prompt": "“Lord, thank You for Your faithfulness in turning even difficult situations for good. Help me to trust You more.”"
  },
  "January 29": {
    "Scripture Passage": "Exodus 1:1-14",
    "Reflective Question": "How does the Israelites’ oppression in Egypt remind you of God’s awareness of suffering?",
    "Prayer Prompt": "“Lord, thank You for seeing my struggles. Help me trust that You are working, even when I don’t see immediate relief.”"
  },
  "January 30": {
    "Scripture Passage": "Exodus 1:15-22",
    "Reflective Question": "What can you learn from the courage of the Hebrew midwives in standing up for what is right?",
    "Prayer Prompt": "“God, give me the courage to stand up for righteousness, even when it’s difficult or risky.”"
  },
  "January 31": {
    "Scripture Passage": "Exodus 2:1-10",
    "Reflective Question": "How does God’s protection of Moses inspire you to trust in His plans, even when they seem unlikely?",
    "Prayer Prompt": "“Father, help me to trust that You are protecting and guiding me, even when I feel vulnerable.”"
  },
  "February 1": {
    "Scripture Passage": "Exodus 2:11-25",
    "Reflective Question": "How does Moses’ journey of exile reflect God’s preparation for His plans?",
    "Prayer Prompt": "“Lord, prepare my heart and life for Your purposes, even when I don’t understand the process.”"
  },
  "February 2": {
    "Scripture Passage": "Exodus 3:1-10",
    "Reflective Question": "What can you learn from God’s calling of Moses about His desire to use unlikely people for His purposes?",
    "Prayer Prompt": "“God, open my heart to Your calling. Help me to see that You can use me, despite my weaknesses.”"
  },
  "February 3": {
    "Scripture Passage": "Exodus 3:11-22",
    "Reflective Question": "How does God’s reassurance to Moses encourage you to depend on His presence when facing challenges?",
    "Prayer Prompt": "“Father, help me to trust Your presence with me. Give me confidence that You will equip me for what You’ve called me to do.”"
  },
  "February 4": {
    "Scripture Passage": "Exodus 12:1-13",
    "Reflective Question": "What does the Passover teach you about God’s provision for salvation?",
    "Prayer Prompt": "“Lord, thank You for providing salvation. Help me to remember Your sacrifice and live with gratitude.”"
  },
  "February 5": {
    "Scripture Passage": "Exodus 14:1-14",
    "Reflective Question": "How does Moses’ confidence in God’s deliverance inspire you to trust God when faced with fear?",
    "Prayer Prompt": "“God, help me to trust You when I am afraid. Give me confidence that You are fighting for me.”"
  },
  "February 6": {
    "Scripture Passage": "Exodus 14:15-22",
    "Reflective Question": "What can you learn from God’s miraculous parting of the sea about His power to make a way where there seems to be none?",
    "Prayer Prompt": "“Lord, make a way in my life where it seems impossible. Help me to trust in Your miraculous power.”"
  },
  "February 7": {
    "Scripture Passage": "Exodus 20:1-17",
    "Reflective Question": "How do the Ten Commandments reflect God’s desire for a life that honors Him and others?",
    "Prayer Prompt": "“Lord, help me to live according to Your commandments, honoring You and others in all I do.”"
  },
  "February 8": {
    "Scripture Passage": "Joshua 1:1-9",
    "Reflective Question": "How does God’s command to be strong and courageous inspire you in your own challenges?",
    "Prayer Prompt": "“God, give me strength and courage as I face the challenges You have set before me.”"
  },
  "February 9": {
    "Scripture Passage": "Joshua 6:1-7",
    "Reflective Question": "What does God’s unconventional strategy at Jericho teach you about following His instructions, even when they seem unusual?",
    "Prayer Prompt": "“Father, help me to obey Your guidance, even when I don’t understand it fully.”"
  },
  "February 10": {
    "Scripture Passage": "Joshua 6:8-21",
    "Reflective Question": "How does the fall of Jericho inspire you to trust God for breakthroughs in your life?",
    "Prayer Prompt": "“Lord, bring down the walls that keep me from experiencing Your promises, and help me to trust in Your timing.”"
  },
  "February 11": {
    "Scripture Passage": "Judges 6:1-10",
    "Reflective Question": "How does Israel’s oppression by the Midianites show you the consequences of turning away from God?",
    "Prayer Prompt": "“God, draw me closer to You, keeping my heart from straying and facing the consequences of sin.”"
  },
  "February 12": {
    "Scripture Passage": "Judges 6:11-24",
    "Reflective Question": "What can you learn from Gideon’s initial doubts and God’s encouragement about overcoming insecurity?",
    "Prayer Prompt": "“Lord, help me to trust in Your strength, even when I feel inadequate or insecure.”"
  },
  "February 13": {
    "Scripture Passage": "Judges 6:25-32",
    "Reflective Question": "How does Gideon’s courage to tear down idols challenge you to confront the idols in your own life?",
    "Prayer Prompt": "“Father, help me to tear down any idols that compete for my devotion, and to honor You above all else.”"
  },
  "February 14": {
    "Scripture Passage": "Judges 7:1-8",
    "Reflective Question": "How does God’s reduction of Gideon’s army show His desire to receive the glory for victory?",
    "Prayer Prompt": "“Lord, let my victories be a testimony to Your power, not my own strength.”"
  },
  "February 15": {
    "Scripture Passage": "Judges 16:23-31",
    "Reflective Question": "How does Samson’s final act of faith encourage you to turn back to God, even after failure?",
    "Prayer Prompt": "“God, thank You for Your grace, even after failure. Give me the strength to return to You and fulfill Your purpose.”"
  },
  "February 16": {
    "Scripture Passage": "1 Samuel 16:1-13",
    "Reflective Question": "How does God’s choice of David challenge your perceptions of who God can use for His purposes?",
    "Prayer Prompt": "“Father, help me to look at the heart, not outward appearances. Mold my heart to be fully devoted to You.”"
  },
  "February 17": {
    "Scripture Passage": "1 Samuel 17:1-11",
    "Reflective Question": "How does Goliath’s challenge represent the fears and obstacles in your own life that seem insurmountable?",
    "Prayer Prompt": "“God, give me courage to face the giants in my life with faith in Your power.”"
  },
  "February 18": {
    "Scripture Passage": "1 Samuel 17:26-50",
    "Reflective Question": "How does David’s victory over Goliath remind you that God’s power, not human strength, leads to victory?",
    "Prayer Prompt": "“God, help me to rely on Your strength and not my own in the battles I face.”"
  },
  "February 19": {
    "Scripture Passage": "2 Samuel 7:1-17",
    "Reflective Question": "How does God’s covenant with David encourage you to trust in God’s faithfulness to His promises?",
    "Prayer Prompt": "“God, thank You for Your faithfulness to Your promises. Strengthen my faith to believe in Your everlasting covenant.”"
  },
  "February 20": {
    "Scripture Passage": "2 Samuel 7:18-29",
    "Reflective Question": "What does David’s prayer of gratitude teach you about responding to God’s blessings with humility?",
    "Prayer Prompt": "“Father, cultivate a heart of humility and gratitude within me. Help me to acknowledge Your blessings with thankfulness.”"
  },
  "February 21": {
    "Scripture Passage": "Psalm 23:1-6",
    "Reflective Question": "How does knowing God as your Shepherd bring comfort and rest to your soul?",
    "Prayer Prompt": "“Lord, be my Shepherd today. Lead me, restore me, and help me to find rest in Your presence.”"
  },
  "February 22": {
    "Scripture Passage": "Psalm 51:1-12",
    "Reflective Question": "What does David’s prayer for a clean heart teach you about the need for ongoing transformation in your life?",
    "Prayer Prompt": "“Lord, create a clean heart in me and renew my spirit. Make me steadfast in my walk with You.”"
  },
  "February 23": {
    "Scripture Passage": "Psalm 103:1-14",
    "Reflective Question": "How does God’s character, as described in this psalm, encourage you to approach Him with confidence?",
    "Prayer Prompt": "“God, thank You for Your compassion and grace. Teach me to approach You confidently, knowing that You love me.”"
  },
  "February 24": {
    "Scripture Passage": "Proverbs 3:1-12",
    "Reflective Question": "How does the call to trust in the Lord over your own understanding challenge you to surrender control to God?",
    "Prayer Prompt": "“Father, teach me to trust You with all my heart, not leaning on my own understanding but acknowledging You in everything.”"
  },
  "February 25": {
    "Scripture Passage": "Ecclesiastes 3:1-15",
    "Reflective Question": "How does the idea of a time for everything encourage you to trust God’s timing in your life?",
    "Prayer Prompt": "“God, help me to accept Your timing, trusting that You make everything beautiful in its time.”"
  },
  "February 26": {
    "Scripture Passage": "Isaiah 9:1-7",
    "Reflective Question": "How does Isaiah’s prophecy about the coming Messiah encourage you to trust in God’s plan for redemption?",
    "Prayer Prompt": "“Lord, thank You for the hope of Jesus. Help me to trust Your plan for redemption in my life.”"
  },
  "February 27": {
    "Scripture Passage": "Isaiah 53:1-12",
    "Reflective Question": "What does Isaiah’s description of the suffering servant teach you about God’s love and sacrifice for you?",
    "Prayer Prompt": "“Father, thank You for Jesus’ sacrifice. Help me to live in gratitude for the price He paid for my sins.”"
  },
  "February 28": {
    "Scripture Passage": "Jeremiah 29:4-14",
    "Reflective Question": "How does God’s promise to the exiles to prosper them and give them hope inspire you to trust Him in difficult seasons?",
    "Prayer Prompt": "“God, thank You for Your plans for my future. Help me to seek You and trust in Your promises during difficult times.”"
  },
  "March 1": {
    "Scripture Passage": "Ezekiel 37:1-14",
    "Reflective Question": "How does the vision of dry bones coming to life encourage you to believe in God’s power to bring restoration?",
    "Prayer Prompt": "“Lord, breathe new life into the dry and weary areas of my life. Help me to trust in Your power to restore.”"
  },
  "March 2": {
    "Scripture Passage": "Daniel 3:1-30",
    "Reflective Question": "How does the story of the fiery furnace inspire you to stand firm in your faith, even in the face of trials?",
    "Prayer Prompt": "“God, give me courage to stand firm in my faith, knowing that You are with me in every trial.”"
  },
  "March 3": {
    "Scripture Passage": "Daniel 6:1-28",
    "Reflective Question": "How does Daniel’s faithfulness in prayer challenge you to remain consistent in your relationship with God?",
    "Prayer Prompt": "“Lord, help me to remain faithful in prayer and devotion, no matter the pressures I face.”"
  },
  "March 4": {
    "Scripture Passage": "Jonah 1:1-17",
    "Reflective Question": "What does Jonah’s initial disobedience teach you about responding to God’s call in your life?",
    "Prayer Prompt": "“God, help me to listen to Your call and obey, even when it’s challenging or unexpected.”"
  },
  "March 5": {
    "Scripture Passage": "Jonah 2:1-10",
    "Reflective Question": "How does Jonah’s prayer of repentance remind you to call on God, even when you’ve strayed?",
    "Prayer Prompt": "“Father, thank You for hearing me when I call. Help me to turn back to You in repentance and trust.”"
  },
  "March 6": {
    "Scripture Passage": "Jonah 3:1-10",
    "Reflective Question": "How does Nineveh’s repentance show you the power of God’s mercy for those who turn to Him?",
    "Prayer Prompt": "“Lord, thank You for Your mercy. Help me to repent quickly and walk in obedience to You.”"
  },
  "March 7": {
    "Scripture Passage": "Micah 6:6-8",
    "Reflective Question": "What does it mean to act justly, love mercy, and walk humbly with God in your daily life?",
    "Prayer Prompt": "“God, teach me to live justly, love mercy, and walk humbly with You each day.”"
  },
  "March 8": {
    "Scripture Passage": "Matthew 1:18-25",
    "Reflective Question": "How does Joseph’s obedience to God in difficult circumstances challenge you to trust God’s plan?",
    "Prayer Prompt": "“Lord, help me to trust and obey Your plans, even when they require courage and faith.”"
  },
  "March 9": {
    "Scripture Passage": "Matthew 2:1-12",
    "Reflective Question": "How does the journey of the wise men inspire you to seek and worship Jesus in your own life?",
    "Prayer Prompt": "“Father, help me to seek Jesus wholeheartedly and worship Him as my King.”"
  },
  "March 10": {
    "Scripture Passage": "Matthew 3:1-17",
    "Reflective Question": "How does Jesus’ baptism reveal His identity and mission, and how does it affirm your identity in Him?",
    "Prayer Prompt": "“God, thank You for affirming me as Your child through Jesus. Help me to walk confidently in my identity in Christ.”"
  },
  "March 11": {
    "Scripture Passage": "Matthew 4:1-11",
    "Reflective Question": "How does Jesus’ victory over temptation encourage you to resist the enemy with the Word of God?",
    "Prayer Prompt": "“Lord, equip me with Your Word to resist temptation and stand firm in my faith.”"
  },
  "March 12": {
    "Scripture Passage": "Matthew 5:1-12",
    "Reflective Question": "How do the Beatitudes challenge you to live with a heart that reflects God’s kingdom values?",
    "Prayer Prompt": "“Father, help me to embody the attitudes of humility, mercy, and purity that reflect Your kingdom.”"
  },
  "March 13": {
    "Scripture Passage": "Matthew 6:5-15",
    "Reflective Question": "What does Jesus’ teaching on prayer teach you about the importance of forgiveness and daily dependence on God?",
    "Prayer Prompt": "“Lord, teach me to pray with humility and trust. Help me to forgive others as You have forgiven me.”"
  },
  "March 14": {
    "Scripture Passage": "Matthew 7:1-12",
    "Reflective Question": "How does Jesus’ teaching on judgment and the golden rule challenge you to treat others with love and grace?",
    "Prayer Prompt": "“God, help me to judge others with kindness and treat them as I would want to be treated.”"
  },
  "March 15": {
    "Scripture Passage": "Matthew 8:1-17",
    "Reflective Question": "How do Jesus’ healings show His compassion and power to restore what is broken in your life?",
    "Prayer Prompt": "“Lord, thank You for Your compassion. Restore what is broken in my life and make me whole again.”"
  },
  "March 16": {
    "Scripture Passage": "Matthew 14:22-33",
    "Reflective Question": "How does Peter’s walk on water challenge you to trust Jesus in the storms of your life?",
    "Prayer Prompt": "“God, help me to fix my eyes on Jesus and trust Him, even in the midst of life’s storms.”"
  },
  "March 17": {
    "Scripture Passage": "Matthew 16:13-20",
    "Reflective Question": "How does Peter’s confession of Jesus as the Messiah inspire you to declare your faith boldly?",
    "Prayer Prompt": "“Father, strengthen my faith to boldly declare that Jesus is my Lord and Savior.”"
  },
  "March 18": {
    "Scripture Passage": "Matthew 17:1-13",
    "Reflective Question": "How does the transfiguration reveal Jesus’ divine nature and encourage your faith in Him?",
    "Prayer Prompt": "“Lord, open my eyes to see Your glory and strengthen my faith in who You are.”"
  },
  "March 19": {
    "Scripture Passage": "Matthew 18:21-35",
    "Reflective Question": "How does the parable of the unmerciful servant challenge you to forgive as you have been forgiven?",
    "Prayer Prompt": "“Father, help me to forgive others from my heart, just as You have forgiven me through Christ.”"
  },
  "March 20": {
    "Scripture Passage": "Matthew 25:1-13",
    "Reflective Question": "How does the parable of the ten virgins encourage you to stay spiritually prepared for Jesus’ return?",
    "Prayer Prompt": "“God, keep me spiritually alert and ready for the day of Your return.”"
  },
  "March 21": {
    "Scripture Passage": "Matthew 25:31-46",
    "Reflective Question": "How does Jesus’ teaching on serving “the least of these” challenge you to live out your faith in practical ways?",
    "Prayer Prompt": "“Lord, help me to serve others as if I were serving You, with love and compassion.”"
  },
  "March 22": {
    "Scripture Passage": "John 1:1-18",
    "Reflective Question": "How does John’s description of Jesus as the Word made flesh deepen your understanding of who He is?",
    "Prayer Prompt": "“God, thank You for revealing Yourself through Jesus. Help me to know Him more deeply each day.”"
  },
  "March 23": {
    "Scripture Passage": "John 3:1-21",
    "Reflective Question": "How does Jesus’ conversation with Nicodemus challenge you to understand and embrace the new birth?",
    "Prayer Prompt": "“Lord, thank You for the gift of new life through Jesus. Help me to live as a new creation in Him.”"
  },
  "March 24": {
    "Scripture Passage": "John 4:1-26",
    "Reflective Question": "How does Jesus’ encounter with the Samaritan woman show His heart for those who are marginalized?",
    "Prayer Prompt": "“Father, help me to see and love people as You do, extending grace to those who feel forgotten or unworthy.”"
  },
  "March 25": {
    "Scripture Passage": "John 10:1-21",
    "Reflective Question": "How does Jesus’ identity as the Good Shepherd bring comfort and assurance to your life?",
    "Prayer Prompt": "“Lord, thank You for being my Good Shepherd. Lead me, protect me, and help me to follow Your voice.”"
  },
  "March 26": {
    "Scripture Passage": "John 14:1-14",
    "Reflective Question": "How does Jesus’ promise to prepare a place for you inspire hope in your eternal future with Him?",
    "Prayer Prompt": "“God, thank You for the hope of eternal life. Help me to trust in Your promises and walk in faith.”"
  },
  "March 27": {
    "Scripture Passage": "John 15:1-17",
    "Reflective Question": "How does Jesus’ teaching on abiding in Him challenge you to stay connected to Him daily?",
    "Prayer Prompt": "“Lord, help me to abide in You, bearing fruit for Your glory in everything I do.”"
  },
  "March 28": {
    "Scripture Passage": "John 17:1-26",
    "Reflective Question": "How does Jesus’ prayer for His disciples and future believers encourage you to live in unity with others?",
    "Prayer Prompt": "“Father, help me to live in unity with others, reflecting Your love to the world.”"
  },
  "March 29": {
    "Scripture Passage": "John 19:16-30",
    "Reflective Question": "How does Jesus’ sacrifice on the cross demonstrate God’s love for you?",
    "Prayer Prompt": "“Lord, thank You for dying for my sins. Help me to live in gratitude for Your ultimate sacrifice.”"
  },
  "March 30": {
    "Scripture Passage": "John 20:1-18",
    "Reflective Question": "How does the resurrection of Jesus give you hope and joy in your life today?",
    "Prayer Prompt": "“God, thank You for the victory of the resurrection. Help me to live with hope and joy in Your power.”"
  },
  "March 31": {
    "Scripture Passage": "Acts 1:1-11",
    "Reflective Question": "How does the ascension of Jesus and the promise of His return inspire you to live with purpose?",
    "Prayer Prompt": "“Lord, help me to live with purpose, knowing that You are coming again. Empower me to be Your witness.”"
  },
  "April 1": {
    "Scripture Passage": "Acts 2:1-13",
    "Reflective Question": "How does the coming of the Holy Spirit at Pentecost encourage you to rely on His power in your life?",
    "Prayer Prompt": "“Lord, fill me with Your Spirit and empower me to live boldly for You.”"
  },
  "April 2": {
    "Scripture Passage": "Acts 2:14-41",
    "Reflective Question": "How does Peter’s bold proclamation of the Gospel challenge you to share your faith with others?",
    "Prayer Prompt": "“God, give me courage to share the good news of Jesus with those around me.”"
  },
  "April 3": {
    "Scripture Passage": "Acts 4:1-22",
    "Reflective Question": "How does the courage of Peter and John inspire you to stand firm in your faith, even in opposition?",
    "Prayer Prompt": "“Father, strengthen me to stand firm in my faith, no matter the opposition I face.”"
  },
  "April 4": {
    "Scripture Passage": "Acts 6:1-7",
    "Reflective Question": "How does the early church’s care for the needs of others challenge you to serve your community?",
    "Prayer Prompt": "“Lord, help me to see and meet the needs of others with compassion and generosity.”"
  },
  "April 5": {
    "Scripture Passage": "Acts 7:54-60",
    "Reflective Question": "How does Stephen’s faithfulness and forgiveness in the face of death challenge you to trust God completely?",
    "Prayer Prompt": "“God, help me to remain faithful to You and forgive others, even in the most difficult circumstances.”"
  },
  "April 6": {
    "Scripture Passage": "Acts 9:1-19",
    "Reflective Question": "How does Paul’s conversion demonstrate the power of God to transform even the hardest of hearts?",
    "Prayer Prompt": "“Lord, thank You for Your transforming power. Change my heart to align with Your purposes.”"
  },
  "April 7": {
    "Scripture Passage": "Acts 10:1-23",
    "Reflective Question": "How does Peter’s vision challenge you to overcome prejudice and embrace all people as part of God’s plan?",
    "Prayer Prompt": "“Father, open my heart to love and accept others, as You do, without judgment.”"
  },
  "April 8": {
    "Scripture Passage": "Acts 10:24-48",
    "Reflective Question": "How does the inclusion of Cornelius and his household teach you about God’s desire for all people to know Him?",
    "Prayer Prompt": "“God, thank You for Your salvation that reaches all people. Help me to share this hope with others.”"
  },
  "April 9": {
    "Scripture Passage": "Acts 16:25-34",
    "Reflective Question": "How does Paul and Silas’ worship in prison challenge you to trust God and rejoice in difficult circumstances?",
    "Prayer Prompt": "“Lord, help me to worship You and trust in Your deliverance, even when life is hard.”"
  },
  "April 10": {
    "Scripture Passage": "Romans 1:16-17",
    "Reflective Question": "How does Paul’s confidence in the Gospel inspire you to live unashamed of your faith?",
    "Prayer Prompt": "“Father, give me boldness to live unashamed of the Gospel and proclaim it to the world.”"
  },
  "April 11": {
    "Scripture Passage": "Romans 3:21-31",
    "Reflective Question": "How does the righteousness of God through faith in Jesus encourage you to trust in His grace rather than your works?",
    "Prayer Prompt": "“God, thank You for Your grace. Help me to trust in Your righteousness, not my own efforts.”"
  },
  "April 12": {
    "Scripture Passage": "Romans 5:1-11",
    "Reflective Question": "How does the hope found in God’s love and reconciliation through Jesus strengthen you in your daily struggles?",
    "Prayer Prompt": "“Lord, thank You for reconciling me to Yourself through Jesus. Fill me with hope and peace each day.”"
  },
  "April 13": {
    "Scripture Passage": "Romans 8:1-17",
    "Reflective Question": "How does the assurance of no condemnation in Christ encourage you to live in the freedom of the Spirit?",
    "Prayer Prompt": "“Father, help me to live in the freedom and assurance of no condemnation in Christ Jesus.”"
  },
  "April 14": {
    "Scripture Passage": "Romans 8:18-39",
    "Reflective Question": "How does the promise that nothing can separate you from God’s love strengthen your faith in His care?",
    "Prayer Prompt": "“God, thank You for Your unshakable love. Help me to trust You in every circumstance.”"
  },
  "April 15": {
    "Scripture Passage": "Romans 12:1-8",
    "Reflective Question": "How does the call to offer yourself as a living sacrifice challenge you to live for God’s purposes?",
    "Prayer Prompt": "“Lord, teach me to live as a living sacrifice, offering all I am for Your glory.”"
  },
  "April 16": {
    "Scripture Passage": "Romans 12:9-21",
    "Reflective Question": "How does Paul’s teaching on love challenge you to reflect Christ’s love in your relationships?",
    "Prayer Prompt": "“Father, help me to love sincerely, even when it’s hard. Teach me to overcome evil with good.”"
  },
  "April 17": {
    "Scripture Passage": "1 Corinthians 1:18-31",
    "Reflective Question": "How does the message of the cross remind you of God’s power and wisdom, even when the world sees it as foolishness?",
    "Prayer Prompt": "“God, thank You for the power of the cross. Help me to trust in Your wisdom, even when it’s countercultural.”"
  },
  "April 18": {
    "Scripture Passage": "1 Corinthians 12:12-31",
    "Reflective Question": "How does Paul’s teaching on the body of Christ inspire you to embrace your unique role in the church?",
    "Prayer Prompt": "“Lord, help me to use my gifts to build up the body of Christ and to serve Your kingdom.”"
  },
  "April 19": {
    "Scripture Passage": "1 Corinthians 13:1-13",
    "Reflective Question": "How does the description of love challenge you to live out genuine love in your life?",
    "Prayer Prompt": "“Father, help me to love as You do—with patience, kindness, and truth.”"
  },
  "April 20": {
    "Scripture Passage": "2 Corinthians 4:1-18",
    "Reflective Question": "How does Paul’s perseverance in trials encourage you to focus on the eternal rather than the temporary?",
    "Prayer Prompt": "“God, strengthen me to endure hardships and keep my eyes fixed on eternal glory.”"
  },
  "April 21": {
    "Scripture Passage": "2 Corinthians 5:11-21",
    "Reflective Question": "How does the call to be an ambassador for Christ challenge you to live missionally?",
    "Prayer Prompt": "“Lord, use me as Your ambassador to share the message of reconciliation with others.”"
  },
  "April 22": {
    "Scripture Passage": "Galatians 5:13-26",
    "Reflective Question": "How does Paul’s teaching on the fruit of the Spirit challenge you to live by the Spirit daily?",
    "Prayer Prompt": "“Father, produce the fruit of the Spirit in my life as I walk with You each day.”"
  },
  "April 23": {
    "Scripture Passage": "Ephesians 2:1-10",
    "Reflective Question": "How does the truth that you are saved by grace through faith encourage you to live in gratitude and purpose?",
    "Prayer Prompt": "“God, thank You for saving me by grace. Help me to live for Your purposes, not my own.”"
  },
  "April 24": {
    "Scripture Passage": "Ephesians 6:10-20",
    "Reflective Question": "How does the armor of God equip you to stand strong against spiritual challenges?",
    "Prayer Prompt": "“Lord, clothe me with Your armor so that I may stand firm in the battle against the enemy.”"
  },
  "April 25": {
    "Scripture Passage": "Philippians 2:1-11",
    "Reflective Question": "How does the humility of Jesus inspire you to serve others selflessly?",
    "Prayer Prompt": "“Father, teach me to follow Jesus’ example of humility and serve others with love.”"
  },
  "April 26": {
    "Scripture Passage": "Philippians 4:4-13",
    "Reflective Question": "How does Paul’s teaching on contentment challenge you to trust God in every situation?",
    "Prayer Prompt": "“God, teach me to be content in all circumstances, trusting that You are my strength and provider.”"
  },
  "April 27": {
    "Scripture Passage": "Colossians 3:1-17",
    "Reflective Question": "How does Paul’s call to set your mind on things above challenge you to live a Christ-centered life?",
    "Prayer Prompt": "“Lord, help me to set my mind on heavenly things and live for Your glory in everything I do.”"
  },
  "April 28": {
    "Scripture Passage": "1 Thessalonians 4:13-18",
    "Reflective Question": "How does the promise of Jesus’ return encourage you to live with hope and purpose?",
    "Prayer Prompt": "“God, thank You for the promise of Jesus’ return. Help me to live with hope and readiness each day.”"
  },
  "April 29": {
    "Scripture Passage": "2 Timothy 3:14-17",
    "Reflective Question": "How does Paul’s teaching on Scripture inspire you to seek God’s Word for guidance and growth?",
    "Prayer Prompt": "“Father, thank You for Your Word. Teach me to rely on it for wisdom and strength in my daily life.”"
  },
  "April 30": {
    "Scripture Passage": "Hebrews 12:1-3",
    "Reflective Question": "How does the call to run with perseverance encourage you to fix your eyes on Jesus through challenges?",
    "Prayer Prompt": "“Lord, help me to fix my eyes on Jesus and run the race with perseverance and faith.”"
  },
  "May 1": {
    "Scripture Passage": "Hebrews 13:1-8",
    "Reflective Question": "How does the call to love and hospitality challenge you to reflect Christ’s character in your relationships?",
    "Prayer Prompt": "“Lord, help me to love others genuinely and practice hospitality, reflecting Your character.”"
  },
  "May 2": {
    "Scripture Passage": "James 1:2-12",
    "Reflective Question": "How does James’ teaching on perseverance through trials encourage you to trust God in difficult times?",
    "Prayer Prompt": "“God, give me strength to persevere through trials, knowing they produce maturity and faith.”"
  },
  "May 3": {
    "Scripture Passage": "James 2:14-26",
    "Reflective Question": "How does James’ teaching on faith and works challenge you to live out your faith through actions?",
    "Prayer Prompt": "“Father, help me to demonstrate my faith through love and good works that honor You.”"
  },
  "May 4": {
    "Scripture Passage": "1 Peter 1:3-12",
    "Reflective Question": "How does Peter’s teaching on living hope encourage you to rejoice in your eternal inheritance?",
    "Prayer Prompt": "“God, thank You for the living hope I have through Jesus. Help me to rejoice in my eternal inheritance.”"
  },
  "May 5": {
    "Scripture Passage": "1 Peter 2:1-12",
    "Reflective Question": "How does Peter’s call to be a living stone challenge you to live as part of God’s spiritual house?",
    "Prayer Prompt": "“Lord, help me to live as Your chosen and holy child, shining Your light in the world.”"
  },
  "May 6": {
    "Scripture Passage": "1 Peter 5:6-11",
    "Reflective Question": "How does Peter’s encouragement to cast your anxieties on God remind you to trust in His care?",
    "Prayer Prompt": "“Father, thank You for caring for me. Help me to cast my worries on You and trust in Your faithfulness.”"
  },
  "May 7": {
    "Scripture Passage": "2 Peter 1:3-11",
    "Reflective Question": "How does Peter’s call to grow in faith challenge you to pursue godliness and spiritual growth?",
    "Prayer Prompt": "“God, teach me to grow in faith and to pursue the qualities that reflect Your divine nature.”"
  },
  "May 8": {
    "Scripture Passage": "1 John 1:5-10",
    "Reflective Question": "How does John’s teaching on walking in the light challenge you to live in honesty and repentance?",
    "Prayer Prompt": "“Lord, help me to walk in the light of Your truth, confessing my sins and seeking Your forgiveness.”"
  },
  "May 9": {
    "Scripture Passage": "1 John 3:1-10",
    "Reflective Question": "How does John’s teaching on being a child of God inspire you to live righteously?",
    "Prayer Prompt": "“Father, thank You for making me Your child. Help me to live in righteousness and reflect Your love.”"
  },
  "May 10": {
    "Scripture Passage": "Revelation 1:9-20",
    "Reflective Question": "How does John’s vision of Jesus encourage you to trust in His sovereignty and glory?",
    "Prayer Prompt": "“Lord, thank You for revealing Your power and majesty. Help me to trust in Your sovereign plan.”"
  },
  "May 11": {
    "Scripture Passage": "Revelation 4:1-11",
    "Reflective Question": "How does the vision of worship in heaven inspire you to worship God wholeheartedly in your life?",
    "Prayer Prompt": "“Father, help me to worship You with awe and wonder, as You deserve all glory and honor.”"
  },
  "May 12": {
    "Scripture Passage": "Revelation 5:1-14",
    "Reflective Question": "How does the Lamb’s worthiness encourage you to place your hope in Jesus?",
    "Prayer Prompt": "“Lord, thank You for being the Lamb who was slain. Help me to live in gratitude and trust in Your victory.”"
  },
  "May 13": {
    "Scripture Passage": "Revelation 7:9-17",
    "Reflective Question": "How does the vision of the great multitude encourage you to trust in God’s promise of eternal protection and provision?",
    "Prayer Prompt": "“God, thank You for Your promises of eternal provision. Help me to live in hope of being with You forever.”"
  },
  "May 14": {
    "Scripture Passage": "Revelation 19:6-16",
    "Reflective Question": "How does the vision of the returning King inspire you to live with expectancy and faithfulness?",
    "Prayer Prompt": "“Lord, help me to live with faithfulness, looking forward to Your victorious return.”"
  },
  "May 15": {
    "Scripture Passage": "Revelation 21:1-8",
    "Reflective Question": "How does the promise of the new heaven and new earth give you hope in God’s restoration plan?",
    "Prayer Prompt": "“Father, thank You for the hope of eternal restoration. Help me to live with faith in Your perfect plan.”"
  },
  "May 16": {
    "Scripture Passage": "Revelation 22:1-7",
    "Reflective Question": "How does the vision of the river of life encourage you to anticipate the fullness of life with God?",
    "Prayer Prompt": "“God, thank You for the promise of eternal life with You. Help me to live in anticipation of Your glory.”"
  },
  "May 17": {
    "Scripture Passage": "Psalm 1:1-6",
    "Reflective Question": "How does the call to delight in God’s Word challenge you to meditate on Scripture daily?",
    "Prayer Prompt": "“Lord, help me to delight in Your Word and meditate on it, that I may bear fruit in all I do.”"
  },
  "May 18": {
    "Scripture Passage": "Psalm 23:1-6",
    "Reflective Question": "How does knowing God as your Shepherd bring peace and assurance to your daily life?",
    "Prayer Prompt": "“Father, thank You for being my Shepherd. Lead me, restore me, and guide me with Your loving care.”"
  },
  "May 19": {
    "Scripture Passage": "Proverbs 3:1-12",
    "Reflective Question": "How does the call to trust in the Lord with all your heart challenge you to surrender your plans to Him?",
    "Prayer Prompt": "“God, help me to trust You completely, acknowledging You in all my ways.”"
  },
  "May 20": {
    "Scripture Passage": "Ecclesiastes 3:1-15",
    "Reflective Question": "How does the truth that there is a time for everything encourage you to trust God’s timing in your life?",
    "Prayer Prompt": "“Lord, help me to trust Your timing, knowing You make everything beautiful in its time.”"
  },
  "May 21": {
    "Scripture Passage": "Isaiah 40:28-31",
    "Reflective Question": "How does the promise of renewed strength encourage you to wait on the Lord in challenging times?",
    "Prayer Prompt": "“Father, give me strength as I wait on You. Renew my spirit and help me to trust in Your power.”"
  },
  "May 22": {
    "Scripture Passage": "Jeremiah 29:11-14",
    "Reflective Question": "How does God’s promise of hope and a future encourage you to trust His plans, even in uncertainty?",
    "Prayer Prompt": "“God, thank You for Your plans for me. Help me to seek You with all my heart.”"
  },
  "May 23": {
    "Scripture Passage": "Ezekiel 36:25-28",
    "Reflective Question": "How does God’s promise to give a new heart inspire you to seek transformation in your life?",
    "Prayer Prompt": "“Lord, create in me a new heart and renew my spirit to follow Your ways.”"
  },
  "May 24": {
    "Scripture Passage": "Daniel 3:13-27",
    "Reflective Question": "How does the faith of Shadrach, Meshach, and Abednego inspire you to trust God in the fire?",
    "Prayer Prompt": "“Father, give me faith to trust You, even when I face fiery trials.”"
  },
  "May 25": {
    "Scripture Passage": "Jonah 1:1-17",
    "Reflective Question": "How does Jonah’s initial disobedience remind you of the importance of following God’s call?",
    "Prayer Prompt": "“God, help me to listen and obey when You call me, trusting in Your plans.”"
  },
  "May 26": {
    "Scripture Passage": "Micah 6:6-8",
    "Reflective Question": "How does the call to act justly, love mercy, and walk humbly challenge you to reflect God’s character?",
    "Prayer Prompt": "“Lord, help me to live justly, love mercy, and walk humbly with You each day.”"
  },
  "May 27": {
    "Scripture Passage": "Zechariah 9:9-10",
    "Reflective Question": "How does the prophecy of the coming King inspire you to rejoice in God’s faithfulness?",
    "Prayer Prompt": "“Father, thank You for Your faithfulness in sending Jesus. Help me to trust in Your promises.”"
  },
  "May 28": {
    "Scripture Passage": "Matthew 5:1-12",
    "Reflective Question": "How do the Beatitudes challenge you to live with a heart that reflects God’s kingdom values?",
    "Prayer Prompt": "“Lord, help me to embody the attitudes of humility, mercy, and purity that reflect Your kingdom.”"
  },
  "May 29": {
    "Scripture Passage": "Matthew 6:5-15",
    "Reflective Question": "How does Jesus’ teaching on prayer encourage you to deepen your relationship with the Father?",
    "Prayer Prompt": "“Father, teach me to pray with faith, seeking Your will and forgiveness in all things.”"
  },
  "May 30": {
    "Scripture Passage": "Matthew 28:18-20",
    "Reflective Question": "How does the Great Commission inspire you to live as a disciple and make disciples?",
    "Prayer Prompt": "“God, help me to live as Your disciple, sharing Your love and truth with others.”"
  },
  "May 31": {
    "Scripture Passage": "John 15:1-8",
    "Reflective Question": "How does the call to abide in Christ challenge you to stay connected to Him daily?",
    "Prayer Prompt": "“Lord, teach me to abide in You, bearing fruit for Your glory in all that I do.”"
  },
  "June 1": {
    "Scripture Passage": "Acts 2:42-47",
    "Reflective Question": "How does the early church’s devotion to community and prayer inspire you to grow in fellowship with others?",
    "Prayer Prompt": "“Lord, help me to grow in community and devotion, reflecting the unity of the early church.”"
  },
  "June 2": {
    "Scripture Passage": "Romans 8:28-39",
    "Reflective Question": "How does the promise that nothing can separate you from God’s love strengthen your faith?",
    "Prayer Prompt": "“God, thank You for Your unshakable love. Help me to trust in Your faithfulness through every trial.”"
  },
  "June 3": {
    "Scripture Passage": "1 Corinthians 13:1-13",
    "Reflective Question": "How does Paul’s description of love challenge you to live with genuine love in your relationships?",
    "Prayer Prompt": "“Father, help me to love others as You do—with patience, kindness, and truth.”"
  },
  "June 4": {
    "Scripture Passage": "Galatians 5:13-26",
    "Reflective Question": "How does the call to live by the Spirit encourage you to produce the fruit of the Spirit in your life?",
    "Prayer Prompt": "“Lord, guide me to walk by the Spirit and reflect Your character in my actions.”"
  },
  "June 5": {
    "Scripture Passage": "Philippians 4:4-13",
    "Reflective Question": "How does Paul’s teaching on contentment inspire you to trust God in every situation?",
    "Prayer Prompt": "“God, help me to find strength and contentment in You, no matter my circumstances.”"
  },
  "June 6": {
    "Scripture Passage": "Colossians 3:1-17",
    "Reflective Question": "How does Paul’s call to set your mind on heavenly things challenge you to live a Christ-centered life?",
    "Prayer Prompt": "“Father, teach me to focus on what matters eternally and live for Your glory.”"
  },
  "June 7": {
    "Scripture Passage": "Hebrews 12:1-3",
    "Reflective Question": "How does the call to run the race with perseverance encourage you to fix your eyes on Jesus through challenges?",
    "Prayer Prompt": "“Lord, help me to endure life’s challenges by keeping my focus on Jesus.”"
  },
  "June 8": {
    "Scripture Passage": "James 1:19-27",
    "Reflective Question": "How does James’ teaching on being doers of the Word challenge you to live out your faith practically?",
    "Prayer Prompt": "“God, teach me to not only hear Your Word but to live it out daily in obedience and love.”"
  },
  "June 9": {
    "Scripture Passage": "1 Peter 2:9-12",
    "Reflective Question": "How does the call to be a chosen people inspire you to live as a witness to God’s goodness?",
    "Prayer Prompt": "“Lord, help me to live as a light in the world, reflecting Your goodness and love.”"
  },
  "June 10": {
    "Scripture Passage": "1 John 4:7-21",
    "Reflective Question": "How does John’s teaching on love remind you of the importance of loving others as God loves you?",
    "Prayer Prompt": "“Father, fill me with Your love so I can love others deeply and sincerely.”"
  },
  "June 11": {
    "Scripture Passage": "Revelation 21:1-7",
    "Reflective Question": "How does the promise of the new heaven and new earth encourage you to trust in God’s restoration plan?",
    "Prayer Prompt": "“God, thank You for the hope of eternal restoration. Help me to live in faith and anticipation of Your plan.”"
  },
  "June 12": {
    "Scripture Passage": "Psalm 23:1-6",
    "Reflective Question": "How does knowing God as your Shepherd bring peace and assurance to your daily life?",
    "Prayer Prompt": "“Lord, thank You for being my Shepherd. Lead me and guide me with Your care.”"
  },
  "June 13": {
    "Scripture Passage": "Proverbs 3:1-12",
    "Reflective Question": "How does trusting in the Lord with all your heart challenge you to surrender your plans to Him?",
    "Prayer Prompt": "“God, help me to trust You completely, acknowledging You in all my decisions.”"
  },
  "June 14": {
    "Scripture Passage": "Isaiah 40:28-31",
    "Reflective Question": "How does the promise of renewed strength encourage you to wait on the Lord in challenging times?",
    "Prayer Prompt": "“Father, renew my strength as I trust in You. Help me to soar on wings like eagles.”"
  },
  "June 15": {
    "Scripture Passage": "Jeremiah 29:11-14",
    "Reflective Question": "How does God’s promise of hope and a future inspire you to trust His plans?",
    "Prayer Prompt": "“God, thank You for Your plans for my life. Help me to seek You with all my heart.”"
  },
  "June 16": {
    "Scripture Passage": "Ezekiel 36:25-28",
    "Reflective Question": "How does God’s promise to give a new heart encourage you to seek transformation in your life?",
    "Prayer Prompt": "“Lord, create in me a clean heart and renew my spirit to follow Your ways.”"
  },
  "June 17": {
    "Scripture Passage": "Matthew 5:1-12",
    "Reflective Question": "How do the Beatitudes challenge you to live with a heart that reflects God’s kingdom values?",
    "Prayer Prompt": "“Father, teach me to live with humility, mercy, and purity that reflect Your kingdom.”"
  },
  "June 18": {
    "Scripture Passage": "Matthew 6:5-15",
    "Reflective Question": "How does Jesus’ teaching on prayer encourage you to deepen your relationship with the Father?",
    "Prayer Prompt": "“Lord, teach me to pray with faith, seeking Your will and forgiveness in all things.”"
  },
  "June 19": {
    "Scripture Passage": "Matthew 28:18-20",
    "Reflective Question": "How does the Great Commission inspire you to live as a disciple and make disciples?",
    "Prayer Prompt": "“God, help me to live as Your disciple and share Your love with others.”"
  },
  "June 20": {
    "Scripture Passage": "John 15:1-8",
    "Reflective Question": "How does the call to abide in Christ challenge you to stay connected to Him daily?",
    "Prayer Prompt": "“Lord, teach me to abide in You, bearing fruit for Your glory in all I do.”"
  },
  "June 21": {
    "Scripture Passage": "Acts 1:8",
    "Reflective Question": "How does Jesus’ promise of the Holy Spirit empower you to be His witness in your life?",
    "Prayer Prompt": "“Holy Spirit, empower me to live boldly for Christ and share His love with others.”"
  },
  "June 22": {
    "Scripture Passage": "Acts 2:42-47",
    "Reflective Question": "How does the early church’s devotion to community and prayer inspire you to grow in fellowship with others?",
    "Prayer Prompt": "“Lord, help me to grow in community and devotion, reflecting the unity of the early church.”"
  },
  "June 23": {
    "Scripture Passage": "Romans 12:9-21",
    "Reflective Question": "How does Paul’s teaching on love inspire you to live in harmony with others?",
    "Prayer Prompt": "“Father, help me to love sincerely and overcome evil with good.”"
  },
  "June 24": {
    "Scripture Passage": "1 Corinthians 12:12-27",
    "Reflective Question": "How does Paul’s teaching on the body of Christ inspire you to embrace your unique role in the church?",
    "Prayer Prompt": "“Lord, help me to use my gifts to build up the body of Christ and serve Your kingdom.”"
  },
  "June 25": {
    "Scripture Passage": "Philippians 2:1-11",
    "Reflective Question": "How does Jesus’ humility inspire you to serve others selflessly?",
    "Prayer Prompt": "“Father, teach me to follow Jesus’ example of humility and love in my relationships.”"
  },
  "June 26": {
    "Scripture Passage": "Philippians 4:4-7",
    "Reflective Question": "How does Paul’s encouragement to rejoice in the Lord challenge you to find peace in prayer?",
    "Prayer Prompt": "“God, help me to rejoice in You and find peace as I bring my concerns to You in prayer.”"
  },
  "June 27": {
    "Scripture Passage": "Colossians 3:1-17",
    "Reflective Question": "How does setting your mind on things above challenge you to focus on Christ in daily life?",
    "Prayer Prompt": "“Lord, help me to set my heart and mind on heavenly things and glorify You in all I do.”"
  },
  "June 28": {
    "Scripture Passage": "Hebrews 10:19-25",
    "Reflective Question": "How does the call to encourage one another inspire you to build community in your faith?",
    "Prayer Prompt": "“Father, help me to be an encourager who builds up others in faith and love.”"
  },
  "June 29": {
    "Scripture Passage": "James 2:14-26",
    "Reflective Question": "How does James’ teaching on faith and works challenge you to live out your faith?",
    "Prayer Prompt": "“Lord, help me to demonstrate my faith through love and actions that honor You.”"
  },
  "June 30": {
    "Scripture Passage": "1 John 4:7-21",
    "Reflective Question": "How does God’s love inspire you to love others deeply and sincerely?",
    "Prayer Prompt": "“God, fill my heart with Your love so I may love others as You love me.”"
  },
  "July 1": {
    "Scripture Passage": "Psalm 19:1-14",
    "Reflective Question": "How does David’s praise of God’s creation and Word inspire you to worship and follow Him?",
    "Prayer Prompt": "“Lord, help me to see Your glory in creation and follow Your Word with a willing heart.”"
  },
  "July 2": {
    "Scripture Passage": "Psalm 46:1-11",
    "Reflective Question": "How does knowing God is your refuge and strength encourage you in times of trouble?",
    "Prayer Prompt": "“Father, thank You for being my refuge and strength. Help me to trust You in difficult times.”"
  },
  "July 3": {
    "Scripture Passage": "Psalm 139:1-16",
    "Reflective Question": "How does David’s awareness of God’s intimate knowledge of him encourage you to trust in God’s care?",
    "Prayer Prompt": "“Lord, thank You for knowing me so deeply. Help me to rest in Your perfect care.”"
  },
  "July 4": {
    "Scripture Passage": "Proverbs 4:1-9",
    "Reflective Question": "How does the call to seek wisdom inspire you to prioritize God’s guidance in your decisions?",
    "Prayer Prompt": "“Father, help me to seek Your wisdom and treasure it in my life.”"
  },
  "July 5": {
    "Scripture Passage": "Proverbs 16:1-9",
    "Reflective Question": "How does trusting in God’s plan challenge you to surrender your own understanding and plans to Him?",
    "Prayer Prompt": "“Lord, guide my steps and help me to trust Your perfect plans over my own.”"
  },
  "July 6": {
    "Scripture Passage": "Ecclesiastes 12:1-14",
    "Reflective Question": "How does the conclusion to fear God and keep His commands shape your perspective on life’s purpose?",
    "Prayer Prompt": "“God, help me to honor You and live according to Your will as the ultimate purpose of my life.”"
  },
  "July 7": {
    "Scripture Passage": "Isaiah 6:1-8",
    "Reflective Question": "How does Isaiah’s vision of God’s holiness inspire you to respond, “Here I am, send me”?",
    "Prayer Prompt": "“Lord, reveal Your holiness to me and prepare my heart to say, ‘Here I am, send me.’”"
  },
  "July 8": {
    "Scripture Passage": "Isaiah 55:6-13",
    "Reflective Question": "How does God’s promise that His Word will not return void encourage you to trust in its power?",
    "Prayer Prompt": "“Father, thank You for the power of Your Word. Help me to trust in its ability to transform lives.”"
  },
  "July 9": {
    "Scripture Passage": "Jeremiah 17:5-10",
    "Reflective Question": "How does the contrast between trusting in man and trusting in God challenge you to place your confidence in Him?",
    "Prayer Prompt": "“Lord, teach me to trust in You with all my heart and not rely on human strength.”"
  },
  "July 10": {
    "Scripture Passage": "Ezekiel 37:1-14",
    "Reflective Question": "How does the vision of the dry bones coming to life remind you of God’s power to bring renewal and restoration?",
    "Prayer Prompt": "“God, breathe new life into the dry areas of my life. Restore me according to Your power.”"
  },
  "July 11": {
    "Scripture Passage": "Daniel 6:10-23",
    "Reflective Question": "How does Daniel’s faithfulness in prayer inspire you to remain steadfast in your relationship with God?",
    "Prayer Prompt": "“Lord, help me to remain faithful in prayer, trusting in Your presence and deliverance.”"
  },
  "July 12": {
    "Scripture Passage": "Hosea 6:1-6",
    "Reflective Question": "How does God’s desire for steadfast love rather than sacrifice challenge you to prioritize a sincere heart over actions?",
    "Prayer Prompt": "“Father, help me to seek a sincere relationship with You above mere outward actions.”"
  },
  "July 13": {
    "Scripture Passage": "Micah 7:18-20",
    "Reflective Question": "How does God’s mercy and forgiveness encourage you to trust in His faithfulness and love?",
    "Prayer Prompt": "“God, thank You for Your mercy. Help me to walk confidently in Your forgiveness and grace.”"
  },
  "July 14": {
    "Scripture Passage": "Zechariah 9:9-12",
    "Reflective Question": "How does the prophecy of the coming King inspire you to trust in Jesus as your Savior and Deliverer?",
    "Prayer Prompt": "“Lord, thank You for being my King and Deliverer. Help me to trust in Your salvation.”"
  },
  "July 15": {
    "Scripture Passage": "Matthew 11:28-30",
    "Reflective Question": "How does Jesus’ invitation to come to Him for rest encourage you to bring your burdens to Him?",
    "Prayer Prompt": "“Father, thank You for offering rest for my soul. Help me to lay my burdens at Your feet.”"
  },
  "July 16": {
    "Scripture Passage": "Matthew 22:34-40",
    "Reflective Question": "How does the greatest commandment challenge you to love God and others with your whole heart?",
    "Prayer Prompt": "“God, help me to love You with all my heart, soul, and mind, and to love others as myself.”"
  },
  "July 17": {
    "Scripture Passage": "Matthew 25:31-46",
    "Reflective Question": "How does Jesus’ teaching on serving “the least of these” challenge you to live out your faith in action?",
    "Prayer Prompt": "“Lord, help me to serve others with love, knowing I am serving You.”"
  },
  "July 18": {
    "Scripture Passage": "Luke 10:25-37",
    "Reflective Question": "How does the parable of the Good Samaritan inspire you to show compassion and kindness to others?",
    "Prayer Prompt": "“Father, teach me to love my neighbor and to act with compassion toward those in need.”"
  },
  "July 19": {
    "Scripture Passage": "Luke 15:1-7",
    "Reflective Question": "How does the parable of the lost sheep remind you of God’s relentless pursuit of you and others?",
    "Prayer Prompt": "“Lord, thank You for pursuing me with Your love. Help me to seek the lost with the same compassion.”"
  },
  "July 20": {
    "Scripture Passage": "Luke 15:11-32",
    "Reflective Question": "How does the parable of the prodigal son encourage you to return to God and trust in His grace?",
    "Prayer Prompt": "“Father, thank You for Your forgiveness and grace. Help me to always run back to You.”"
  },
  "July 21": {
    "Scripture Passage": "John 6:35-40",
    "Reflective Question": "How does Jesus’ teaching that He is the bread of life encourage you to rely on Him for spiritual sustenance?",
    "Prayer Prompt": "“Lord, help me to find my satisfaction and sustenance in You alone.”"
  },
  "July 22": {
    "Scripture Passage": "John 14:15-21",
    "Reflective Question": "How does Jesus’ promise of the Holy Spirit encourage you to trust in His presence and guidance?",
    "Prayer Prompt": "“Holy Spirit, fill me and guide me as I walk in obedience to Jesus.”"
  },
  "July 23": {
    "Scripture Passage": "John 15:9-17",
    "Reflective Question": "How does Jesus’ command to love one another challenge you to reflect His love in your relationships?",
    "Prayer Prompt": "“Father, help me to love others as Jesus has loved me, with selflessness and grace.”"
  },
  "July 24": {
    "Scripture Passage": "Acts 2:1-13",
    "Reflective Question": "How does the coming of the Holy Spirit at Pentecost encourage you to live boldly in faith?",
    "Prayer Prompt": "“Lord, fill me with Your Spirit and empower me to live boldly for You.”"
  },
  "July 25": {
    "Scripture Passage": "Acts 4:23-31",
    "Reflective Question": "How does the believers’ prayer for boldness inspire you to trust God in times of opposition?",
    "Prayer Prompt": "“Father, give me boldness to proclaim Your Word, even in the face of challenges.”"
  },
  "July 26": {
    "Scripture Passage": "Acts 9:1-19",
    "Reflective Question": "How does Paul’s conversion reveal God’s ability to transform even the hardest of hearts?",
    "Prayer Prompt": "“God, thank You for Your transforming power. Change my heart to align with Your will.”"
  },
  "July 27": {
    "Scripture Passage": "Romans 8:1-11",
    "Reflective Question": "How does the assurance of no condemnation in Christ encourage you to live in freedom and victory?",
    "Prayer Prompt": "“Lord, help me to walk in the freedom and victory of life in Christ.”"
  },
  "July 28": {
    "Scripture Passage": "Romans 12:1-8",
    "Reflective Question": "How does Paul’s call to be a living sacrifice challenge you to offer your life to God fully?",
    "Prayer Prompt": "“Father, help me to live as a living sacrifice, offering all I am for Your glory.”"
  },
  "July 29": {
    "Scripture Passage": "1 Corinthians 15:50-58",
    "Reflective Question": "How does the promise of victory over death encourage you to remain steadfast in your faith?",
    "Prayer Prompt": "“God, thank You for the victory of the resurrection. Help me to stand firm in my faith and serve You fully.”"
  },
  "July 30": {
    "Scripture Passage": "Philippians 3:7-14",
    "Reflective Question": "How does Paul’s desire to press on toward the goal challenge you to pursue Christ above all else?",
    "Prayer Prompt": "“Lord, help me to press on toward the goal of knowing You and fulfilling Your purpose for my life.”"
  },
  "July 31": {
    "Scripture Passage": "Revelation 21:1-5",
    "Reflective Question": "How does the vision of the new heaven and earth inspire you to live in hope of God’s restoration?",
    "Prayer Prompt": "“Father, thank You for the promise of restoration. Help me to live in anticipation of Your eternal glory.”"
  },
  "August 1": {
    "Scripture Passage": "Psalm 27:1-14",
    "Reflective Question": "How does David’s trust in God’s protection encourage you to remain confident in the face of fear?",
    "Prayer Prompt": "“Lord, be my light and salvation. Help me to trust You in all circumstances.”"
  },
  "August 2": {
    "Scripture Passage": "Psalm 51:1-12",
    "Reflective Question": "How does David’s prayer for a clean heart inspire you to seek God’s forgiveness and renewal?",
    "Prayer Prompt": "“Father, create in me a clean heart and renew my spirit. Help me to walk in Your ways.”"
  },
  "August 3": {
    "Scripture Passage": "Proverbs 16:1-9",
    "Reflective Question": "How does trusting in God’s plan challenge you to surrender your own understanding and follow His guidance?",
    "Prayer Prompt": "“Lord, guide my steps and help me trust in Your perfect plan over my own desires.”"
  },
  "August 4": {
    "Scripture Passage": "Ecclesiastes 3:1-11",
    "Reflective Question": "How does the truth that there is a time for everything encourage you to trust in God’s timing?",
    "Prayer Prompt": "“God, help me to trust Your timing, knowing You make all things beautiful in their time.”"
  },
  "August 5": {
    "Scripture Passage": "Isaiah 40:28-31",
    "Reflective Question": "How does God’s promise of renewed strength encourage you to wait on Him in difficult times?",
    "Prayer Prompt": "“Lord, renew my strength as I wait on You. Help me to soar with confidence in Your power.”"
  },
  "August 6": {
    "Scripture Passage": "Jeremiah 31:31-34",
    "Reflective Question": "How does God’s promise of a new covenant encourage you to trust in His love and forgiveness?",
    "Prayer Prompt": "“Father, thank You for writing Your law on my heart. Help me to live in relationship with You.”"
  },
  "August 7": {
    "Scripture Passage": "Ezekiel 36:25-27",
    "Reflective Question": "How does God’s promise to give a new heart and spirit inspire you to seek transformation in your life?",
    "Prayer Prompt": "“Lord, give me a clean heart and renew my spirit to follow Your ways faithfully.”"
  },
  "August 8": {
    "Scripture Passage": "Hosea 14:1-9",
    "Reflective Question": "How does God’s promise of healing and love for Israel encourage you to return to Him?",
    "Prayer Prompt": "“Father, heal my heart and help me to return to You with love and devotion.”"
  },
  "August 9": {
    "Scripture Passage": "Micah 6:6-8",
    "Reflective Question": "How does the call to act justly, love mercy, and walk humbly challenge you to live in a way that honors God?",
    "Prayer Prompt": "“Lord, help me to live justly, love mercy, and walk humbly with You each day.”"
  },
  "August 10": {
    "Scripture Passage": "Zechariah 9:9-10",
    "Reflective Question": "How does the prophecy of the coming King inspire you to trust in Jesus as your Savior and Deliverer?",
    "Prayer Prompt": "“Lord, thank You for being my King and Deliverer. Help me to trust in Your salvation.”"
  },
  "August 11": {
    "Scripture Passage": "Matthew 5:13-16",
    "Reflective Question": "How does Jesus’ call to be the light of the world challenge you to reflect His light in your life?",
    "Prayer Prompt": "“Father, help me to shine Your light in my actions and words, pointing others to You.”"
  },
  "August 12": {
    "Scripture Passage": "Matthew 6:19-34",
    "Reflective Question": "How does Jesus’ teaching on worry challenge you to trust God with your needs and future?",
    "Prayer Prompt": "“Lord, help me to seek Your kingdom first and trust You with all my worries and needs.”"
  },
  "August 13": {
    "Scripture Passage": "Matthew 9:35-38",
    "Reflective Question": "How does Jesus’ compassion for the crowds inspire you to pray for and share His love with others?",
    "Prayer Prompt": "“Father, give me compassion for others and help me to share the good news of Jesus.”"
  },
  "August 14": {
    "Scripture Passage": "Matthew 11:28-30",
    "Reflective Question": "How does Jesus’ invitation to come to Him for rest encourage you to lay down your burdens?",
    "Prayer Prompt": "“Lord, thank You for offering rest for my soul. Help me to lay my burdens at Your feet.”"
  },
  "August 15": {
    "Scripture Passage": "Matthew 28:18-20",
    "Reflective Question": "How does the Great Commission challenge you to live as a disciple and make disciples of others?",
    "Prayer Prompt": "“God, empower me to live as Your disciple and to share Your love and truth with others.”"
  },
  "August 16": {
    "Scripture Passage": "Luke 10:25-37",
    "Reflective Question": "How does the parable of the Good Samaritan inspire you to show love and kindness to others?",
    "Prayer Prompt": "“Father, teach me to love my neighbor and act with compassion to those in need.”"
  },
  "August 17": {
    "Scripture Passage": "Luke 15:1-10",
    "Reflective Question": "How does the parable of the lost sheep and coin remind you of God’s relentless pursuit of those who are lost?",
    "Prayer Prompt": "“Lord, thank You for seeking and saving the lost. Help me to reflect Your heart in pursuing others with love.”"
  },
  "August 18": {
    "Scripture Passage": "John 6:35-40",
    "Reflective Question": "How does Jesus’ teaching as the bread of life encourage you to rely on Him for spiritual sustenance?",
    "Prayer Prompt": "“Lord, help me to find my satisfaction and sustenance in You alone.”"
  },
  "August 19": {
    "Scripture Passage": "John 14:1-6",
    "Reflective Question": "How does Jesus’ promise to prepare a place for you inspire hope in your eternal future with Him?",
    "Prayer Prompt": "“God, thank You for preparing a place for me. Help me to live in anticipation of eternal life with You.”"
  },
  "August 20": {
    "Scripture Passage": "John 15:1-8",
    "Reflective Question": "How does the call to abide in Christ challenge you to remain connected to Him daily?",
    "Prayer Prompt": "“Father, help me to abide in Jesus and bear fruit that glorifies You.”"
  },
  "August 21": {
    "Scripture Passage": "Acts 1:8",
    "Reflective Question": "How does Jesus’ promise of the Holy Spirit empower you to be His witness in your life?",
    "Prayer Prompt": "“Lord, fill me with Your Spirit and help me to live boldly as Your witness.”"
  },
  "August 22": {
    "Scripture Passage": "Acts 2:42-47",
    "Reflective Question": "How does the early church’s devotion to community inspire you to grow in fellowship and prayer?",
    "Prayer Prompt": "“God, help me to be devoted to community, prayer, and worship as a reflection of Your love.”"
  },
  "August 23": {
    "Scripture Passage": "Romans 12:9-21",
    "Reflective Question": "How does Paul’s teaching on love challenge you to live in harmony and overcome evil with good?",
    "Prayer Prompt": "“Lord, teach me to love sincerely and to respond to evil with good, reflecting Your heart.”"
  },
  "August 24": {
    "Scripture Passage": "1 Corinthians 12:12-27",
    "Reflective Question": "How does the image of the body of Christ inspire you to value your role in the church?",
    "Prayer Prompt": "“Father, thank You for gifting me uniquely. Help me to use my gifts to build up Your church.”"
  },
  "August 25": {
    "Scripture Passage": "Philippians 2:1-11",
    "Reflective Question": "How does Jesus’ humility challenge you to serve others selflessly?",
    "Prayer Prompt": "“Lord, help me to have the mindset of Christ, serving others with love and humility.”"
  },
  "August 26": {
    "Scripture Passage": "Philippians 4:4-7",
    "Reflective Question": "How does Paul’s encouragement to rejoice in the Lord challenge you to find peace in prayer?",
    "Prayer Prompt": "“Father, help me to rejoice in You always and bring my concerns to You in prayer.”"
  },
  "August 27": {
    "Scripture Passage": "Colossians 3:1-17",
    "Reflective Question": "How does setting your mind on heavenly things inspire you to live a Christ-centered life?",
    "Prayer Prompt": "“God, help me to focus on things above and glorify You in all I do.”"
  },
  "August 28": {
    "Scripture Passage": "James 2:14-26",
    "Reflective Question": "How does James’ teaching on faith and works challenge you to live out your faith in action?",
    "Prayer Prompt": "“Lord, help me to demonstrate my faith through good works that honor You.”"
  },
  "August 29": {
    "Scripture Passage": "1 Peter 1:3-9",
    "Reflective Question": "How does the hope of an imperishable inheritance encourage you to endure trials with faith?",
    "Prayer Prompt": "“Father, thank You for the living hope I have in Jesus. Help me to trust You through every trial.”"
  },
  "August 30": {
    "Scripture Passage": "1 John 4:7-21",
    "Reflective Question": "How does God’s love inspire you to love others deeply and sincerely?",
    "Prayer Prompt": "“Lord, fill me with Your love so I may love others as You love me.”"
  },
  "August 31": {
    "Scripture Passage": "Revelation 21:1-7",
    "Reflective Question": "How does the promise of a new heaven and new earth encourage you to trust in God’s restoration plan?",
    "Prayer Prompt": "“God, thank You for the hope of eternal restoration. Help me to live in anticipation of Your perfect plan.”"
  },
  "September 1": {
    "Scripture Passage": "Psalm 1:1-6",
    "Reflective Question": "How does delighting in God’s Word challenge you to meditate on it day and night?",
    "Prayer Prompt": "“Lord, help me to delight in Your Word and let it guide my every step.”"
  },
  "September 2": {
    "Scripture Passage": "Psalm 23:1-6",
    "Reflective Question": "How does knowing God as your Shepherd bring peace and assurance to your daily life?",
    "Prayer Prompt": "“Father, thank You for being my Shepherd. Lead me and guide me with Your care.”"
  },
  "September 3": {
    "Scripture Passage": "Proverbs 3:1-12",
    "Reflective Question": "How does trusting in the Lord with all your heart challenge you to surrender your plans to Him?",
    "Prayer Prompt": "“God, help me to trust You completely, acknowledging You in all my decisions.”"
  },
  "September 4": {
    "Scripture Passage": "Ecclesiastes 12:13-14",
    "Reflective Question": "How does the conclusion to fear God and keep His commandments shape your perspective on life’s purpose?",
    "Prayer Prompt": "“Lord, help me to live in reverence of You and follow Your commands as my ultimate purpose.”"
  },
  "September 5": {
    "Scripture Passage": "Isaiah 53:1-12",
    "Reflective Question": "How does the prophecy of the suffering servant deepen your understanding of God’s love and sacrifice for you?",
    "Prayer Prompt": "“Father, thank You for Jesus, the suffering servant, who bore my sins. Help me to live in gratitude.”"
  },
  "September 6": {
    "Scripture Passage": "Isaiah 61:1-3",
    "Reflective Question": "How does the prophecy of the Messiah bringing good news inspire you to trust in God’s comfort and restoration?",
    "Prayer Prompt": "“Lord, thank You for bringing good news to the brokenhearted. Restore my joy and strength in You.”"
  },
  "September 7": {
    "Scripture Passage": "Jeremiah 29:11-14",
    "Reflective Question": "How does God’s promise of hope and a future inspire you to seek Him with all your heart?",
    "Prayer Prompt": "“God, thank You for Your plans for my life. Help me to trust in Your future for me.”"
  },
  "September 8": {
    "Scripture Passage": "Ezekiel 37:1-14",
    "Reflective Question": "How does the vision of dry bones coming to life encourage you to believe in God’s power to restore what seems lost?",
    "Prayer Prompt": "“Lord, breathe new life into the dry areas of my life. Restore my heart and hope in You.”"
  },
  "September 9": {
    "Scripture Passage": "Hosea 6:1-6",
    "Reflective Question": "How does God’s desire for steadfast love rather than sacrifice challenge you to prioritize a sincere relationship with Him?",
    "Prayer Prompt": "“Father, help me to seek a genuine relationship with You above outward actions.”"
  },
  "September 10": {
    "Scripture Passage": "Micah 6:6-8",
    "Reflective Question": "How does the call to act justly, love mercy, and walk humbly inspire you to live in a way that honors God?",
    "Prayer Prompt": "“Lord, teach me to live justly, love mercy, and walk humbly with You each day.”"
  },
  "September 11": {
    "Scripture Passage": "Zechariah 9:9-12",
    "Reflective Question": "How does the prophecy of the coming King inspire you to trust in God’s faithfulness?",
    "Prayer Prompt": "“God, thank You for fulfilling Your promises through Jesus. Help me to live in faith and trust.”"
  },
  "September 12": {
    "Scripture Passage": "Matthew 6:25-34",
    "Reflective Question": "How does Jesus’ teaching on worry challenge you to trust God with your needs and future?",
    "Prayer Prompt": "“Lord, help me to trust You fully and seek Your kingdom first, letting go of my anxieties.”"
  },
  "September 13": {
    "Scripture Passage": "Matthew 7:7-12",
    "Reflective Question": "How does Jesus’ teaching on asking, seeking, and knocking encourage you to approach God with confidence?",
    "Prayer Prompt": "“Father, help me to seek You with faith and trust in Your answers to my prayers.”"
  },
  "September 14": {
    "Scripture Passage": "Matthew 22:34-40",
    "Reflective Question": "How does the greatest commandment challenge you to love God and others with your whole heart?",
    "Prayer Prompt": "“God, teach me to love You with all my heart and love others as myself.”"
  },
  "September 15": {
    "Scripture Passage": "Luke 10:25-37",
    "Reflective Question": "How does the parable of the Good Samaritan inspire you to show compassion to others, even when inconvenient?",
    "Prayer Prompt": "“Lord, help me to love my neighbor and act with kindness and compassion to those in need.”"
  },
  "September 16": {
    "Scripture Passage": "Luke 15:1-10",
    "Reflective Question": "How does the parable of the lost sheep and coin remind you of God’s relentless pursuit of those who are lost?",
    "Prayer Prompt": "“Father, thank You for seeking and saving the lost. Help me to reflect Your love in reaching others.”"
  },
  "September 17": {
    "Scripture Passage": "Luke 15:11-32",
    "Reflective Question": "How does the parable of the prodigal son encourage you to return to God and trust in His forgiveness?",
    "Prayer Prompt": "“God, thank You for Your unconditional love. Help me to always run back to You with confidence in Your grace.”"
  },
  "September 18": {
    "Scripture Passage": "John 10:1-10",
    "Reflective Question": "How does Jesus’ role as the Good Shepherd encourage you to trust Him to lead and protect you?",
    "Prayer Prompt": "“Lord, thank You for being my Good Shepherd. Help me to trust in Your guidance and care.”"
  },
  "September 19": {
    "Scripture Passage": "John 14:1-6",
    "Reflective Question": "How does Jesus’ promise to prepare a place for you inspire hope in your eternal future with Him?",
    "Prayer Prompt": "“Father, thank You for the promise of eternal life. Help me to live in anticipation of being with You forever.”"
  },
  "September 20": {
    "Scripture Passage": "John 15:1-8",
    "Reflective Question": "How does Jesus’ teaching on abiding in Him challenge you to stay connected to Him daily?",
    "Prayer Prompt": "“Lord, help me to remain in You and bear fruit that reflects Your love and purpose.”"
  },
  "September 21": {
    "Scripture Passage": "Acts 1:6-8",
    "Reflective Question": "How does Jesus’ promise of the Holy Spirit empower you to live as His witness?",
    "Prayer Prompt": "“Holy Spirit, fill me and empower me to live boldly as a witness for Jesus.”"
  },
  "September 22": {
    "Scripture Passage": "Acts 4:1-22",
    "Reflective Question": "How does the courage of Peter and John inspire you to stand firm in your faith, even in opposition?",
    "Prayer Prompt": "“Father, give me boldness to stand firm in my faith and proclaim Your truth with confidence.”"
  },
  "September 23": {
    "Scripture Passage": "Romans 8:1-11",
    "Reflective Question": "How does the assurance of no condemnation in Christ encourage you to live in freedom and victory?",
    "Prayer Prompt": "“Lord, help me to live in the freedom and victory that comes from being in Christ Jesus.”"
  },
  "September 24": {
    "Scripture Passage": "Romans 12:1-8",
    "Reflective Question": "How does Paul’s call to be a living sacrifice challenge you to offer your life to God fully?",
    "Prayer Prompt": "“God, help me to live as a living sacrifice, offering all I am for Your glory and purpose.”"
  },
  "September 25": {
    "Scripture Passage": "1 Corinthians 13:1-13",
    "Reflective Question": "How does Paul’s teaching on love challenge you to live with a heart that reflects God’s love?",
    "Prayer Prompt": "“Father, teach me to love others with patience, kindness, and truth that reflects Your character.”"
  },
  "September 26": {
    "Scripture Passage": "Philippians 3:7-14",
    "Reflective Question": "How does Paul’s determination to press on toward the goal challenge you to pursue Christ above all else?",
    "Prayer Prompt": "“Lord, help me to press on toward knowing You and fulfilling Your purpose in my life.”"
  },
  "September 27": {
    "Scripture Passage": "Colossians 3:1-17",
    "Reflective Question": "How does setting your mind on things above inspire you to live a Christ-centered life?",
    "Prayer Prompt": "“God, help me to focus on eternal things and glorify You in everything I do.”"
  },
  "September 28": {
    "Scripture Passage": "James 1:2-12",
    "Reflective Question": "How does James’ teaching on perseverance through trials encourage you to trust God in difficult times?",
    "Prayer Prompt": "“Father, give me strength to persevere through trials, knowing they produce maturity and faith.”"
  },
  "September 29": {
    "Scripture Passage": "1 Peter 2:9-12",
    "Reflective Question": "How does Peter’s teaching on being a chosen people inspire you to live as a witness to God’s goodness?",
    "Prayer Prompt": "“Lord, help me to live as Your chosen child, reflecting Your goodness and love to others.”"
  },
  "September 30": {
    "Scripture Passage": "Revelation 21:1-8",
    "Reflective Question": "How does the promise of a new heaven and new earth encourage you to trust in God’s restoration plan?",
    "Prayer Prompt": "“God, thank You for the hope of eternal restoration. Help me to live in faith and anticipation of Your perfect plan.”"
  },
  "October 1": {
    "Scripture Passage": "Psalm 19:1-14",
    "Reflective Question": "How does David’s praise for God’s creation and Word inspire you to worship and follow Him?",
    "Prayer Prompt": "“Lord, help me to see Your glory in creation and follow Your Word with joy and obedience.”"
  },
  "October 2": {
    "Scripture Passage": "Psalm 46:1-11",
    "Reflective Question": "How does knowing God as your refuge and strength encourage you to trust Him in times of trouble?",
    "Prayer Prompt": "“Father, thank You for being my refuge and strength. Help me to trust You in difficult moments.”"
  },
  "October 3": {
    "Scripture Passage": "Psalm 139:1-16",
    "Reflective Question": "How does David’s awareness of God’s intimate knowledge of him inspire you to rest in His care?",
    "Prayer Prompt": "“Lord, thank You for knowing me completely. Help me to trust in Your perfect care and love.”"
  },
  "October 4": {
    "Scripture Passage": "Proverbs 4:1-9",
    "Reflective Question": "How does the call to seek wisdom inspire you to prioritize God’s guidance in your life?",
    "Prayer Prompt": "“God, help me to seek Your wisdom and treasure it in my heart daily.”"
  },
  "October 5": {
    "Scripture Passage": "Proverbs 16:1-9",
    "Reflective Question": "How does trusting in God’s plan challenge you to surrender your own understanding and follow His lead?",
    "Prayer Prompt": "“Father, guide my steps and teach me to trust in Your perfect plan over my own desires.”"
  },
  "October 6": {
    "Scripture Passage": "Ecclesiastes 12:1-14",
    "Reflective Question": "How does Solomon’s conclusion to fear God and keep His commandments shape your perspective on life’s purpose?",
    "Prayer Prompt": "“Lord, help me to honor You and live in obedience as the ultimate purpose of my life.”"
  },
  "October 7": {
    "Scripture Passage": "Isaiah 6:1-8",
    "Reflective Question": "How does Isaiah’s vision of God’s holiness inspire you to respond, ‘Here I am, send me’?",
    "Prayer Prompt": "“Lord, reveal Your holiness to me and prepare my heart to say, ‘Here I am, send me.’”"
  },
  "October 8": {
    "Scripture Passage": "Isaiah 40:28-31",
    "Reflective Question": "How does the promise of renewed strength inspire you to wait on the Lord during challenging times?",
    "Prayer Prompt": "“God, renew my strength as I trust in You. Help me to soar on wings like eagles.”"
  },
  "October 9": {
    "Scripture Passage": "Jeremiah 17:5-10",
    "Reflective Question": "How does the contrast between trusting in man and trusting in God challenge you to place your confidence in Him?",
    "Prayer Prompt": "“Lord, teach me to trust in You fully and not rely on human strength or understanding.”"
  },
  "October 10": {
    "Scripture Passage": "Ezekiel 37:1-14",
    "Reflective Question": "How does the vision of dry bones coming to life encourage you to believe in God’s power to restore and renew?",
    "Prayer Prompt": "“Father, breathe new life into the weary areas of my life. Restore my hope and faith in You.”"
  },
  "October 11": {
    "Scripture Passage": "Daniel 6:10-23",
    "Reflective Question": "How does Daniel’s faithfulness in prayer challenge you to remain steadfast in your relationship with God?",
    "Prayer Prompt": "“Lord, help me to stay committed in prayer, trusting Your presence and deliverance.”"
  },
  "October 12": {
    "Scripture Passage": "Hosea 14:1-9",
    "Reflective Question": "How does God’s promise of healing and restoration encourage you to return to Him with a sincere heart?",
    "Prayer Prompt": "“Father, heal my heart and help me to return to You with love and devotion.”"
  },
  "October 13": {
    "Scripture Passage": "Micah 7:18-20",
    "Reflective Question": "How does God’s mercy and forgiveness inspire you to trust in His faithfulness and love?",
    "Prayer Prompt": "“God, thank You for Your mercy and compassion. Help me to walk confidently in Your forgiveness and grace.”"
  },
  "October 14": {
    "Scripture Passage": "Zechariah 9:9-12",
    "Reflective Question": "How does the prophecy of the coming King encourage you to trust in God’s promises of salvation?",
    "Prayer Prompt": "“Lord, thank You for fulfilling Your promises through Jesus. Help me to live in trust and faithfulness.”"
  },
  "October 15": {
    "Scripture Passage": "Matthew 11:28-30",
    "Reflective Question": "How does Jesus’ invitation to come to Him for rest encourage you to bring your burdens to Him?",
    "Prayer Prompt": "“Lord, thank You for offering rest for my soul. Help me to lay my burdens at Your feet.”"
  },
  "October 16": {
    "Scripture Passage": "Matthew 25:31-46",
    "Reflective Question": "How does Jesus’ teaching on serving ‘the least of these’ challenge you to live out your faith in practical ways?",
    "Prayer Prompt": "“God, help me to serve others with love, knowing I am serving You through my actions.”"
  },
  "October 17": {
    "Scripture Passage": "Luke 10:25-37",
    "Reflective Question": "How does the parable of the Good Samaritan inspire you to show compassion to those in need?",
    "Prayer Prompt": "“Father, help me to love my neighbor and act with kindness and compassion.”"
  },
  "October 18": {
    "Scripture Passage": "Luke 15:11-32",
    "Reflective Question": "How does the parable of the prodigal son encourage you to trust in God’s forgiveness and grace?",
    "Prayer Prompt": "“Lord, thank You for Your unconditional love. Help me to return to You with confidence in Your grace.”"
  },
  "October 19": {
    "Scripture Passage": "John 10:1-10",
    "Reflective Question": "How does Jesus’ role as the Good Shepherd inspire you to trust in His care and guidance?",
    "Prayer Prompt": "“Father, thank You for being my Shepherd. Help me to follow Your lead and trust in Your provision.”"
  },
  "October 20": {
    "Scripture Passage": "John 15:9-17",
    "Reflective Question": "How does Jesus’ command to love one another inspire you to reflect His love in your relationships?",
    "Prayer Prompt": "“Lord, help me to love others as You have loved me, with selflessness and grace.”"
  },
  "October 21": {
    "Scripture Passage": "Acts 2:1-13",
    "Reflective Question": "How does the coming of the Holy Spirit at Pentecost encourage you to live boldly in faith?",
    "Prayer Prompt": "“Holy Spirit, fill me with Your presence and empower me to live boldly for Christ.”"
  },
  "October 22": {
    "Scripture Passage": "Romans 8:1-11",
    "Reflective Question": "How does the assurance of no condemnation in Christ inspire you to live in freedom and victory?",
    "Prayer Prompt": "“Lord, thank You for the freedom and victory that comes through Christ Jesus.”"
  },
  "October 23": {
    "Scripture Passage": "Romans 12:9-21",
    "Reflective Question": "How does Paul’s teaching on love challenge you to overcome evil with good?",
    "Prayer Prompt": "“Father, help me to love sincerely and to respond to evil with goodness, reflecting Your heart.”"
  },
  "October 24": {
    "Scripture Passage": "1 Corinthians 15:50-58",
    "Reflective Question": "How does the promise of victory over death inspire you to stand firm in your faith?",
    "Prayer Prompt": "“God, thank You for the victory of the resurrection. Help me to remain steadfast in faith and hope.”"
  },
  "October 25": {
    "Scripture Passage": "Philippians 2:1-11",
    "Reflective Question": "How does Jesus’ humility inspire you to serve others selflessly?",
    "Prayer Prompt": "“Lord, teach me to have the mindset of Christ and serve others with love and humility.”"
  },
  "October 26": {
    "Scripture Passage": "Colossians 3:1-17",
    "Reflective Question": "How does setting your mind on heavenly things challenge you to live a Christ-centered life?",
    "Prayer Prompt": "“God, help me to focus on heavenly things and live for Your glory in all I do.”"
  },
  "October 27": {
    "Scripture Passage": "James 1:19-27",
    "Reflective Question": "How does James’ teaching on being doers of the Word inspire you to live out your faith?",
    "Prayer Prompt": "“Lord, help me to not only hear Your Word but to put it into action in my daily life.”"
  },
  "October 28": {
    "Scripture Passage": "1 Peter 1:3-9",
    "Reflective Question": "How does the hope of an imperishable inheritance encourage you to endure trials with faith?",
    "Prayer Prompt": "“Father, thank You for the living hope I have in Jesus. Help me to trust You through every challenge.”"
  },
  "October 29": {
    "Scripture Passage": "1 John 4:7-21",
    "Reflective Question": "How does God’s love inspire you to love others deeply and sincerely?",
    "Prayer Prompt": "“Lord, fill me with Your love so I may love others as You have loved me.”"
  },
  "October 30": {
    "Scripture Passage": "Revelation 21:1-7",
    "Reflective Question": "How does the promise of a new heaven and new earth inspire you to trust in God’s restoration plan?",
    "Prayer Prompt": "“God, thank You for the hope of eternal restoration. Help me to live in anticipation of Your perfect plan.”"
  },
  "October 31": {
    "Scripture Passage": "Revelation 22:1-7",
    "Reflective Question": "How does the vision of the river of life inspire you to live in anticipation of God’s eternal presence?",
    "Prayer Prompt": "“Father, thank You for the promise of eternal life with You. Help me to live in faith and anticipation.”"
  },
  "November 1": {
    "Scripture Passage": "Psalm 27:1-14",
    "Reflective Question": "How does David’s trust in God inspire you to face challenges with confidence in His protection?",
    "Prayer Prompt": "“Lord, help me to trust You as my light and salvation in every circumstance.”"
  },
  "November 2": {
    "Scripture Passage": "Psalm 103:1-14",
    "Reflective Question": "How does David’s praise for God’s compassion and forgiveness encourage you to approach Him with gratitude?",
    "Prayer Prompt": "“Father, thank You for Your mercy and grace. Help me to remember all Your benefits and love.”"
  },
  "November 3": {
    "Scripture Passage": "Proverbs 16:1-9",
    "Reflective Question": "How does trusting in God’s plan challenge you to surrender your own understanding and follow His guidance?",
    "Prayer Prompt": "“Lord, guide my steps and help me trust in Your perfect plan over my desires.”"
  },
  "November 4": {
    "Scripture Passage": "Ecclesiastes 3:1-15",
    "Reflective Question": "How does the truth that there is a time for everything encourage you to trust God’s timing in your life?",
    "Prayer Prompt": "“Father, teach me to trust Your timing and know that You make everything beautiful in its time.”"
  },
  "November 5": {
    "Scripture Passage": "Isaiah 55:6-13",
    "Reflective Question": "How does God’s promise that His Word will not return void encourage you to trust in its power and purpose?",
    "Prayer Prompt": "“Lord, thank You for the power of Your Word. Help me to trust in its ability to accomplish Your will.”"
  },
  "November 6": {
    "Scripture Passage": "Jeremiah 31:31-34",
    "Reflective Question": "How does God’s promise of a new covenant inspire you to trust in His love and forgiveness?",
    "Prayer Prompt": "“Father, thank You for writing Your law on my heart. Help me to live in relationship with You.”"
  },
  "November 7": {
    "Scripture Passage": "Ezekiel 36:25-27",
    "Reflective Question": "How does God’s promise to give a new heart and spirit encourage you to seek transformation in your life?",
    "Prayer Prompt": "“Lord, create in me a clean heart and renew my spirit to follow You faithfully.”"
  },
  "November 8": {
    "Scripture Passage": "Daniel 3:13-30",
    "Reflective Question": "How does the faith of Shadrach, Meshach, and Abednego inspire you to trust God even in the fire?",
    "Prayer Prompt": "“Father, give me faith to trust You and stand firm, even in the midst of trials.”"
  },
  "November 9": {
    "Scripture Passage": "Hosea 14:1-9",
    "Reflective Question": "How does God’s promise of healing and love encourage you to return to Him wholeheartedly?",
    "Prayer Prompt": "“God, heal my heart and help me to return to You with love and devotion.”"
  },
  "November 10": {
    "Scripture Passage": "Micah 6:6-8",
    "Reflective Question": "How does the call to act justly, love mercy, and walk humbly inspire you to live in a way that honors God?",
    "Prayer Prompt": "“Lord, help me to live justly, love mercy, and walk humbly with You each day.”"
  },
  "November 11": {
    "Scripture Passage": "Zechariah 9:9-12",
    "Reflective Question": "How does the prophecy of the coming King inspire you to trust in God’s promises?",
    "Prayer Prompt": "“Father, thank You for fulfilling Your promises through Jesus. Help me to trust in Your faithfulness.”"
  },
  "November 12": {
    "Scripture Passage": "Matthew 5:13-16",
    "Reflective Question": "How does Jesus’ call to be the light of the world challenge you to reflect His light in your life?",
    "Prayer Prompt": "“Lord, help me to shine Your light in my actions and words, pointing others to You.”"
  },
  "November 13": {
    "Scripture Passage": "Matthew 6:19-34",
    "Reflective Question": "How does Jesus’ teaching on worry inspire you to trust God with your needs and future?",
    "Prayer Prompt": "“Father, help me to seek Your kingdom first and trust You with all my worries.”"
  },
  "November 14": {
    "Scripture Passage": "Matthew 28:18-20",
    "Reflective Question": "How does the Great Commission challenge you to live as a disciple and make disciples of others?",
    "Prayer Prompt": "“Lord, empower me to live as Your disciple and share Your love with others.”"
  },
  "November 15": {
    "Scripture Passage": "Luke 10:25-37",
    "Reflective Question": "How does the parable of the Good Samaritan inspire you to show compassion to others?",
    "Prayer Prompt": "“Father, teach me to love my neighbor and act with compassion toward those in need.”"
  },
  "November 16": {
    "Scripture Passage": "Luke 15:1-10",
    "Reflective Question": "How does the parable of the lost sheep and coin remind you of God’s relentless pursuit of the lost?",
    "Prayer Prompt": "“God, thank You for seeking and saving the lost. Help me to reflect Your love in reaching others.”"
  },
  "November 17": {
    "Scripture Passage": "John 6:35-40",
    "Reflective Question": "How does Jesus’ teaching that He is the bread of life encourage you to rely on Him for spiritual sustenance?",
    "Prayer Prompt": "“Lord, help me to find my satisfaction and sustenance in You alone.”"
  },
  "November 18": {
    "Scripture Passage": "John 14:1-6",
    "Reflective Question": "How does Jesus’ promise to prepare a place for you inspire hope in your eternal future with Him?",
    "Prayer Prompt": "“Father, thank You for the promise of eternal life. Help me to live in anticipation of being with You forever.”"
  },
  "November 19": {
    "Scripture Passage": "John 15:1-8",
    "Reflective Question": "How does Jesus’ teaching on abiding in Him challenge you to stay connected to Him daily?",
    "Prayer Prompt": "“Lord, help me to remain in You and bear fruit that reflects Your love and purpose.”"
  },
  "November 20": {
    "Scripture Passage": "Acts 1:6-8",
    "Reflective Question": "How does Jesus’ promise of the Holy Spirit empower you to live as His witness?",
    "Prayer Prompt": "“Holy Spirit, fill me and empower me to live boldly as a witness for Jesus.”"
  },
  "November 21": {
    "Scripture Passage": "Acts 9:1-19",
    "Reflective Question": "How does Paul’s conversion reveal God’s ability to transform even the hardest of hearts?",
    "Prayer Prompt": "“God, thank You for Your transforming power. Change my heart to align with Your will.”"
  },
  "November 22": {
    "Scripture Passage": "Romans 8:1-11",
    "Reflective Question": "How does the assurance of no condemnation in Christ encourage you to live in freedom and victory?",
    "Prayer Prompt": "“Father, thank You for the freedom and victory that comes through Jesus.”"
  },
  "November 23": {
    "Scripture Passage": "Romans 12:1-8",
    "Reflective Question": "How does Paul’s call to be a living sacrifice challenge you to offer your life to God fully?",
    "Prayer Prompt": "“Lord, help me to live as a living sacrifice, offering all I am for Your glory and purpose.”"
  },
  "November 24": {
    "Scripture Passage": "1 Corinthians 12:12-27",
    "Reflective Question": "How does Paul’s teaching on the body of Christ inspire you to embrace your role in the church?",
    "Prayer Prompt": "“Father, help me to use my gifts to build up the body of Christ and serve Your kingdom.”"
  },
  "November 25": {
    "Scripture Passage": "Philippians 2:1-11",
    "Reflective Question": "How does Jesus’ humility inspire you to serve others selflessly?",
    "Prayer Prompt": "“Lord, teach me to have the mindset of Christ and serve others with love and humility.”"
  },
  "November 26": {
    "Scripture Passage": "Colossians 3:1-17",
    "Reflective Question": "How does setting your mind on heavenly things challenge you to live a Christ-centered life?",
    "Prayer Prompt": "“God, help me to focus on eternal things and glorify You in all I do.”"
  },
  "November 27": {
    "Scripture Passage": "James 2:14-26",
    "Reflective Question": "How does James’ teaching on faith and works challenge you to live out your faith in action?",
    "Prayer Prompt": "“Lord, help me to demonstrate my faith through good works that honor You.”"
  },
  "November 28": {
    "Scripture Passage": "1 Peter 1:3-9",
    "Reflective Question": "How does the hope of an imperishable inheritance encourage you to endure trials with faith?",
    "Prayer Prompt": "“Father, thank You for the living hope I have in Jesus. Help me to trust You through every challenge.”"
  },
  "November 29": {
    "Scripture Passage": "1 John 4:7-21",
    "Reflective Question": "How does God’s love inspire you to love others deeply and sincerely?",
    "Prayer Prompt": "“Lord, fill me with Your love so I may love others as You have loved me.”"
  },
  "November 30": {
    "Scripture Passage": "Revelation 21:1-7",
    "Reflective Question": "How does the promise of a new heaven and new earth inspire you to trust in God’s restoration plan?",
    "Prayer Prompt": "“God, thank You for the hope of eternal restoration. Help me to live in anticipation of Your perfect plan.”"
  },
  "December 1": {
    "Scripture Passage": "Psalm 100:1-5",
    "Reflective Question": "How does this psalm of thanksgiving inspire you to cultivate gratitude and praise in your life?",
    "Prayer Prompt": "“Lord, thank You for Your goodness and faithfulness. Help me to praise You with a joyful heart.”"
  },
  "December 2": {
    "Scripture Passage": "Psalm 121:1-8",
    "Reflective Question": "How does knowing that God is your helper and protector encourage you in times of uncertainty?",
    "Prayer Prompt": "“Father, thank You for being my help and protection. Help me to trust in Your care.”"
  },
  "December 3": {
    "Scripture Passage": "Proverbs 3:5-6",
    "Reflective Question": "How does trusting in the Lord with all your heart challenge you to surrender control to Him?",
    "Prayer Prompt": "“Lord, help me to trust You completely and acknowledge You in all my ways.”"
  },
  "December 4": {
    "Scripture Passage": "Ecclesiastes 3:1-15",
    "Reflective Question": "How does the truth that there is a time for everything encourage you to trust God’s timing in your life?",
    "Prayer Prompt": "“Father, teach me to trust Your timing and know that You make everything beautiful in its time.”"
  },
  "December 5": {
    "Scripture Passage": "Isaiah 9:6-7",
    "Reflective Question": "How does the prophecy of the Messiah as the Prince of Peace give you hope in God’s plan for the world?",
    "Prayer Prompt": "“Lord, thank You for sending Jesus as the Prince of Peace. Help me to trust in Your plan for my life.”"
  },
  "December 6": {
    "Scripture Passage": "Isaiah 40:28-31",
    "Reflective Question": "How does God’s promise of renewed strength inspire you to wait on Him during difficult seasons?",
    "Prayer Prompt": "“Lord, renew my strength as I trust in You. Help me to soar on wings like eagles.”"
  },
  "December 7": {
    "Scripture Passage": "Jeremiah 29:11-14",
    "Reflective Question": "How does God’s promise of hope and a future inspire you to seek Him with all your heart?",
    "Prayer Prompt": "“Father, thank You for Your plans for my life. Help me to trust in Your future for me.”"
  },
  "December 8": {
    "Scripture Passage": "Ezekiel 36:25-27",
    "Reflective Question": "How does God’s promise to give a new heart and spirit encourage you to seek transformation in your life?",
    "Prayer Prompt": "“Lord, give me a clean heart and renew my spirit to follow Your ways faithfully.”"
  },
  "December 9": {
    "Scripture Passage": "Micah 6:6-8",
    "Reflective Question": "How does the call to act justly, love mercy, and walk humbly challenge you to live in a way that honors God?",
    "Prayer Prompt": "“Lord, help me to live justly, love mercy, and walk humbly with You each day.”"
  },
  "December 10": {
    "Scripture Passage": "Zechariah 9:9-10",
    "Reflective Question": "How does the prophecy of the coming King inspire you to trust in God’s promises?",
    "Prayer Prompt": "“Father, thank You for fulfilling Your promises through Jesus. Help me to trust in Your faithfulness.”"
  },
  "December 11": {
    "Scripture Passage": "Matthew 5:13-16",
    "Reflective Question": "How does Jesus’ call to be the light of the world inspire you to reflect His light in your life?",
    "Prayer Prompt": "“Lord, help me to shine Your light in my actions and words, pointing others to You.”"
  },
  "December 12": {
    "Scripture Passage": "Matthew 6:25-34",
    "Reflective Question": "How does Jesus’ teaching on worry inspire you to trust God with your needs and future?",
    "Prayer Prompt": "“Father, help me to seek Your kingdom first and trust You with all my worries.”"
  },
  "December 13": {
    "Scripture Passage": "Matthew 11:28-30",
    "Reflective Question": "How does Jesus’ invitation to come to Him for rest encourage you to bring your burdens to Him?",
    "Prayer Prompt": "“Lord, thank You for offering rest for my soul. Help me to lay my burdens at Your feet.”"
  },
  "December 14": {
    "Scripture Passage": "Matthew 28:18-20",
    "Reflective Question": "How does the Great Commission challenge you to live as a disciple and make disciples of others?",
    "Prayer Prompt": "“God, empower me to live as Your disciple and share Your love with others.”"
  },
  "December 15": {
    "Scripture Passage": "Luke 2:8-20",
    "Reflective Question": "How does the angels’ proclamation of Jesus’ birth as good news inspire joy and hope in your life?",
    "Prayer Prompt": "“Father, thank You for the joy of Jesus’ birth. Help me to live in the hope of His salvation.”"
  },
  "December 16": {
    "Scripture Passage": "Luke 10:25-37",
    "Reflective Question": "How does the parable of the Good Samaritan inspire you to show compassion to others, even when inconvenient?",
    "Prayer Prompt": "“Lord, help me to love my neighbor and act with kindness and compassion.”"
  },
  "December 17": {
    "Scripture Passage": "John 1:1-14",
    "Reflective Question": "How does the truth that Jesus is the Word made flesh inspire awe and gratitude in your life?",
    "Prayer Prompt": "“Father, thank You for sending Jesus, the Word made flesh, to dwell among us. Help me to honor Him daily.”"
  },
  "December 18": {
    "Scripture Passage": "John 3:16-21",
    "Reflective Question": "How does the promise of eternal life through Jesus inspire you to trust in God’s love?",
    "Prayer Prompt": "“Lord, thank You for loving me so much that You gave Your Son. Help me to walk in the light of Your truth.”"
  },
  "December 19": {
    "Scripture Passage": "John 15:1-8",
    "Reflective Question": "How does Jesus’ teaching on abiding in Him challenge you to remain connected to Him daily?",
    "Prayer Prompt": "“Lord, help me to remain in You and bear fruit that reflects Your love and purpose.”"
  },
  "December 20": {
    "Scripture Passage": "Acts 2:1-13",
    "Reflective Question": "How does the coming of the Holy Spirit at Pentecost inspire you to live boldly in your faith?",
    "Prayer Prompt": "“Holy Spirit, fill me with Your presence and empower me to live boldly for Christ.”"
  },
  "December 21": {
    "Scripture Passage": "Romans 8:1-11",
    "Reflective Question": "How does the assurance of no condemnation in Christ encourage you to live in freedom and victory?",
    "Prayer Prompt": "“Father, thank You for the freedom and victory that comes through Jesus.”"
  },
  "December 22": {
    "Scripture Passage": "Romans 12:1-8",
    "Reflective Question": "How does Paul’s call to be a living sacrifice challenge you to offer your life to God fully?",
    "Prayer Prompt": "“Lord, help me to live as a living sacrifice, offering all I am for Your glory and purpose.”"
  },
  "December 23": {
    "Scripture Passage": "Philippians 2:1-11",
    "Reflective Question": "How does Jesus’ humility inspire you to serve others selflessly?",
    "Prayer Prompt": "“Father, teach me to follow the example of Jesus’ humility and serve others with love and grace.”"
  },
  "December 24": {
    "Scripture Passage": "Philippians 4:4-7",
    "Reflective Question": "How does Paul’s encouragement to rejoice in the Lord inspire you to find peace through prayer?",
    "Prayer Prompt": "“Lord, help me to rejoice in You always and trust You with my concerns through prayer.”"
  },
  "December 25": {
    "Scripture Passage": "Luke 2:1-7",
    "Reflective Question": "How does the simplicity of Jesus’ birth remind you of God’s humility and love for humanity?",
    "Prayer Prompt": "“Father, thank You for the gift of Jesus. Help me to reflect on His humble birth and great love.”"
  },
  "December 26": {
    "Scripture Passage": "Colossians 3:1-17",
    "Reflective Question": "How does setting your mind on heavenly things challenge you to live a Christ-centered life?",
    "Prayer Prompt": "“God, help me to focus on eternal things and glorify You in all I do.”"
  },
  "December 27": {
    "Scripture Passage": "James 1:2-12",
    "Reflective Question": "How does James’ teaching on perseverance through trials inspire you to trust God in difficult times?",
    "Prayer Prompt": "“Father, help me to trust You in trials, knowing they produce maturity and faith.”"
  },
  "December 28": {
    "Scripture Passage": "1 Peter 1:3-9",
    "Reflective Question": "How does the hope of an imperishable inheritance encourage you to endure trials with faith?",
    "Prayer Prompt": "“Lord, thank You for the living hope I have in Jesus. Help me to trust You through every challenge.”"
  },
  "December 29": {
    "Scripture Passage": "1 John 4:7-21",
    "Reflective Question": "How does God’s love inspire you to love others deeply and sincerely?",
    "Prayer Prompt": "“Father, fill me with Your love so I may love others as You have loved me.”"
  },
  "December 30": {
    "Scripture Passage": "Revelation 21:1-7",
    "Reflective Question": "How does the promise of a new heaven and new earth inspire you to trust in God’s restoration plan?",
    "Prayer Prompt": "“God, thank You for the hope of eternal restoration. Help me to live in faith and anticipation.”"
  },
  "December 31": {
    "Scripture Passage": "Revelation 22:1-7",
    "Reflective Question": "How does the vision of the river of life inspire you to live in anticipation of God’s eternal presence?",
    "Prayer Prompt": "“Lord, thank You for the promise of eternal life with You. Help me to live in faith and anticipation.”"
  }
}