{
    "Week 1": {
        "Reference": "Exodus 34:6",
        "Text": "The Lord, the Lord, the compassionate and gracious God, slow to anger, abounding in love and faithfulness."
    },
    "Week 2": {
        "Reference": "Psalm 86:15",
        "Text": "But you, Lord, are a compassionate and gracious God, slow to anger, abounding in love and faithfulness."
    },
    "Week 3": {
        "Reference": "Lamentations 3:22-23",
        "Text": "Because of the Lord’s great love we are not consumed, for his compassions never fail. They are new every morning; great is your faithfulness."
    },
    "Week 4": {
        "Reference": "Micah 6:8",
        "Text": "He has shown you, O mortal, what is good. And what does the Lord require of you? To act justly and to love mercy and to walk humbly with your God."
    },
    "Week 5": {
        "Reference": "Matthew 5:16",
        "Text": "In the same way, let your light shine before others, that they may see your good deeds and glorify your Father in heaven."
    },
    "Week 6": {
        "Reference": "John 13:34-35",
        "Text": "A new command I give you: Love one another. As I have loved you, so you must love one another. By this everyone will know that you are my disciples, if you love one another."
    },
    "Week 7": {
        "Reference": "Romans 12:2",
        "Text": "Do not conform to the pattern of this world, but be transformed by the renewing of your mind. Then you will be able to test and approve what God’s will is—his good, pleasing and perfect will."
    },
    "Week 8": {
        "Reference": "Galatians 5:22-23",
        "Text": "But the fruit of the Spirit is love, joy, peace, forbearance, kindness, goodness, faithfulness, gentleness and self-control. Against such things there is no law."
    },
    "Week 9": {
        "Reference": "Ephesians 4:2-3",
        "Text": "Be completely humble and gentle; be patient, bearing with one another in love. Make every effort to keep the unity of the Spirit through the bond of peace."
    },
    "Week 10": {
        "Reference": "Philippians 4:8",
        "Text": "Finally, brothers and sisters, whatever is true, whatever is noble, whatever is right, whatever is pure, whatever is lovely, whatever is admirable—if anything is excellent or praiseworthy—think about such things."
    },
    "Week 11": {
        "Reference": "Colossians 3:12-14",
        "Text": "Therefore, as God’s chosen people, holy and dearly loved, clothe yourselves with compassion, kindness, humility, gentleness and patience. Bear with each other and forgive one another if any of you has a grievance against someone. Forgive as the Lord forgave you. And over all these virtues put on love, which binds them all together in perfect unity."
    },
    "Week 12": {
        "Reference": "1 Peter 1:15-16",
        "Text": "But just as he who called you is holy, so be holy in all you do; for it is written: 'Be holy, because I am holy.'"
    },
    "Week 13": {
        "Reference": "Isaiah 41:10",
        "Text": "So do not fear, for I am with you; do not be dismayed, for I am your God. I will strengthen you and help you; I will uphold you with my righteous right hand."
    },
    "Week 14": {
        "Reference": "Proverbs 3:5-6",
        "Text": "Trust in the Lord with all your heart and lean not on your own understanding; in all your ways submit to him, and he will make your paths straight."
    },
    "Week 15": {
        "Reference": "Psalm 46:1",
        "Text": "God is our refuge and strength, an ever-present help in trouble."
    },
    "Week 16": {
        "Reference": "2 Timothy 1:7",
        "Text": "For the Spirit God gave us does not make us timid, but gives us power, love and self-discipline."
    },
    "Week 17": {
        "Reference": "Hebrews 12:2",
        "Text": "Fixing our eyes on Jesus, the pioneer and perfecter of faith. For the joy set before him he endured the cross, scorning its shame, and sat down at the right hand of the throne of God."
    },
    "Week 18": {
        "Reference": "Matthew 6:33",
        "Text": "But seek first his kingdom and his righteousness, and all these things will be given to you as well."
    },
    "Week 19": {
        "Reference": "Romans 8:28",
        "Text": "And we know that in all things God works for the good of those who love him, who have been called according to his purpose."
    },
    "Week 20": {
        "Reference": "1 John 4:19",
        "Text": "We love because he first loved us."
    },
    "Week 21": {
        "Reference": "Philippians 4:6-7",
        "Text": "Do not be anxious about anything, but in every situation, by prayer and petition, with thanksgiving, present your requests to God. And the peace of God, which transcends all understanding, will guard your hearts and your minds in Christ Jesus."
    },
    "Week 22": {
      "Reference": "1 Peter 5:7",
      "Text": "Cast all your anxiety on him because he cares for you."
    },
    "Week 23": {
      "Reference": "Psalm 100:4",
      "Text": "Enter his gates with thanksgiving and his courts with praise; give thanks to him and praise his name."
    },
    "Week 24": {
      "Reference": "Psalm 19:14",
      "Text": "May these words of my mouth and this meditation of my heart be pleasing in your sight, Lord, my Rock and my Redeemer."
    },
    "Week 25": {
      "Reference": "Jeremiah 29:12",
      "Text": "Then you will call on me and come and pray to me, and I will listen to you."
    },
    "Week 26": {
      "Reference": "Matthew 6:9-13",
      "Text": "Our Father in heaven, hallowed be your name, your kingdom come, your will be done, on earth as it is in heaven."
    },
    "Week 27": {
      "Reference": "Philippians 4:6",
      "Text": "Do not be anxious about anything, but in every situation, by prayer and petition, with thanksgiving, present your requests to God."
    },
    "Week 28": {
      "Reference": "1 Thessalonians 5:16-18",
      "Text": "Rejoice always, pray continually, give thanks in all circumstances; for this is God’s will for you in Christ Jesus."
    },
    "Week 29": {
      "Reference": "Psalm 119:105",
      "Text": "Your word is a lamp for my feet, a light on my path."
    },
    "Week 30": {
      "Reference": "Proverbs 3:5-6",
      "Text": "Trust in the Lord with all your heart and lean not on your own understanding."
    },
    "Week 31": {
      "Reference": "Hebrews 11:1",
      "Text": "Now faith is confidence in what we hope for and assurance about what we do not see."
    },
    "Week 32": {
      "Reference": "James 1:2-3",
      "Text": "Consider it pure joy, my brothers and sisters, whenever you face trials of many kinds, because you know that the testing of your faith produces perseverance."
    },
    "Week 33": {
      "Reference": "2 Timothy 1:7",
      "Text": "For the Spirit God gave us does not make us timid, but gives us power, love and self-discipline."
    },
    "Week 34": {
      "Reference": "Psalm 119:11",
      "Text": "I have hidden your word in my heart that I might not sin against you."
    },
    "Week 35": {
      "Reference": "Isaiah 55:11",
      "Text": "So is my word that goes out from my mouth: It will not return to me empty."
    },
    "Week 36": {
      "Reference": "2 Timothy 3:16-17",
      "Text": "All Scripture is God-breathed and is useful for teaching, rebuking, correcting and training in righteousness."
    },
    "Week 37": {
      "Reference": "Hebrews 4:12",
      "Text": "For the word of God is alive and active. Sharper than any double-edged sword."
    },
    "Week 38": {
      "Reference": "Romans 10:17",
      "Text": "Consequently, faith comes from hearing the message, and the message is heard through the word about Christ."
    },
    "Week 39": {
      "Reference": "Deuteronomy 31:8",
      "Text": "The Lord himself goes before you and will be with you; he will never leave you nor forsake you."
    },
    "Week 40": {
      "Reference": "Isaiah 26:3",
      "Text": "You will keep in perfect peace those whose minds are steadfast, because they trust in you."
    },
    "Week 41": {
      "Reference": "Jeremiah 29:11",
      "Text": "For I know the plans I have for you, declares the Lord."
    },
    "Week 42": {
      "Reference": "John 14:27",
      "Text": "Peace I leave with you; my peace I give you."
    },
    "Week 43": {
      "Reference": "Revelation 21:4",
      "Text": "‘He will wipe every tear from their eyes. There will be no more death’ or mourning or crying or pain."
    },
    "Week 44": {
      "Reference": "Romans 12:1-2",
      "Text": "Offer your bodies as a living sacrifice, holy and pleasing to God."
    },
    "Week 45": {
      "Reference": "Colossians 3:23",
      "Text": "Whatever you do, work at it with all your heart, as working for the Lord."
    },
    "Week 46": {
      "Reference": "Ephesians 6:10-11",
      "Text": "Be strong in the Lord and in his mighty power. Put on the full armor of God."
    },
    "Week 47": {
      "Reference": "1 Corinthians 10:31",
      "Text": "So whether you eat or drink or whatever you do, do it all for the glory of God."
    },
    "Week 48": {
      "Reference": "2 Corinthians 5:17",
      "Text": "Therefore, if anyone is in Christ, the new creation has come."
    },
    "Week 49": {
      "Reference": "Galatians 6:9",
      "Text": "Let us not become weary in doing good, for at the proper time we will reap a harvest."
    },
    "Week 50": {
      "Reference": "Philippians 1:6",
      "Text": "He who began a good work in you will carry it on to completion."
    },
    "Week 51": {
      "Reference": "2 Peter 3:9",
      "Text": "The Lord is not slow in keeping his promise, as some understand slowness."
    },
    "Week 52": {
      "Reference": "Micah 6:8",
      "Text": "Mankind, he has told each of you what is good and what it is the Lord requires of you: to act justly, to love faithfulness, and to walk humbly with your God."
    }
}
  